{
  "Document": {
    "DocumentId": -1547361477,
    "Title": "VITAMINS AND MINERALS: TOO MUCH CAN CAUSE BAD RESULTS",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "1999-09-11T16:01:23",
    "ModificationDate": "1999-09-11T16:01:23",
    "TemplateId": null,
    "SegmentId": 81,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "It's true that scientists are learning that some nutrients provide additional health benefits when taken in amounts that exceed current recommendations, which were set at levels to prevent nutritional deficiencies. However, folks who consume eight, 40, or 50 times the recommended levels of some nutrients are playing a dangerous game of nutritional Russian roulette.  \n\nFor instance, although too little vitamin A can lead to night blindness and dry eyes, too much can cause headaches, blurred vision, hair loss, fatigue, and serious liver damage. Running low on iron causes anemia to set in, but an overload of this oxygen-binding mineral increases the risk of diabetes, cirrhosis, and even liver cancer in the nearly 1 out of every 200 to 400 Americans who have an often-overlooked genetic defect known as hemochromatosis.  \n\nTo help guard against dangerous nutritional overload due to supplement use, the newly mandated supplement labels not only must show how much of a nutrient the supplement contains, but also what this amount is as a percent of established nutritional guidelines. In addition, a new type of nutritional recommendation, called the UL or Upper Limit or tolerance, is being established to help consumers avoid the dangerous \nside effects of overloading on vitamins and minerals.  \n\nThe bottom line: Nutrients needed in small amounts can be toxic when taken in excess. So, although most Americans can get all the vitamins and minerals they need by following a healthy diet, if you choose to take supplements, check the labels and know what you're buying.",
  "Tag": "kb-1547361477"
}