{
  "Document": {
    "DocumentId": -24999868,
    "Title": "Creative Labs AWE32: Using the Digital Output on the Sound Blaster AWE32; Sony/Phillips Digital Interface (SP-DIF)",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "1999-02-10T08:29:48",
    "ModificationDate": "1999-02-10T08:29:48",
    "TemplateId": null,
    "SegmentId": 65,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "The AWE32 was the first consumer-level sound card to include a Sony/Philips Digital Interface (SP-DIF) output. The output from this interface can go directly to DAT, DCC (Digital Compact Cassette) or even a digital-signal-ready amplifier. SP-DIF is an internationally recognized standard for audio I/O.\n\nThere are, however, two major drawbacks to Creative Labs' implementation of AWE32 SP-DIF output:\n\n(i) Only the data from the E-mu8000 synthesizer chip is output via SP-DIF. This implies that digitized audio samples (not loaded into Sound Fonts) or CD audio are not output.\n\n(ii) The physical output port is not easily accessible from a closed system unit. This implies that you must open the case of your computer to get to the SP-DIF pins on your installed AWE32 sound card.\n\nHere are some suggestions attempting to solve these problems:\n\n(i) Increase the 36-pin memory capacity on your soundcard. This will allow larger Sound Fonts to be loaded into AWE32 memory. By composing only with Sound Fonts and MIDI messages you can successfully use the SP-DIF port as a key component in a high quality sample playback system. There should be an enhanced clarity and sharpness in the music, almost no white noise and a significantly larger dynamic range.\n\n(ii) Mount your own female RCA jack into a \"back plane\" plate at the back of your PC. The female RCA  jack should be connected to a 0.1\" header connector. This connector will be connected to the SP-DIF connection (JP8). The AWE32 SP-DIF connection has two jumper pins labeled 0 (signal) and 1 (ground). The details of this assembly are beyond the scope of this document. The opinion here is that you will have to familiar with a solder gun.",
  "Tag": "kb-24999868"
}