{
  "Document": {
    "DocumentId": -2025630760,
    "Title": "VB: ADO; More Remarks",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2000-02-03T23:39:10",
    "ModificationDate": "2000-02-03T23:39:10",
    "TemplateId": null,
    "SegmentId": 77,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "The Filter Property\n\nDAO Recordset objects have the Filter Property. I did not start using it until I started using ADO. Just a coincidence. I mention here for historical reasons. It's my history. Moving right along...\n\n\nCalling Stored Procedures with ODBC SQL\n\nThe very concept of ODBC SQL was not formally introduced to me. So now there is MS-SQL (for Access), t-SQL and ODBC SQL. Microsoft recommends using the ODBC CALL escape sequence of this form:\n\n    {[?=]call proc_name[([parameter][,[parameter]]...)]}\n\nIt is important to see that question mark as this is Parameter 0 in the Parameters Collection of a Command object for all stored procedures with parameters. For example, this is what the stored proc' get_cust_dates() looks like in a Command object:\n\n    With cmdADO\n        Set .ActiveConnection = objADO.Connection\n        .CommandText = \"get_cust_dates\"\n        .CommandType = adCmdStoredProc\n        .Parameters.Refresh\n        .Parameters.Item(\"@RETURN_VALUE\") = 0\n        .Parameters.Item(\"@all_dates\") = 1\n        .Parameters.Item(\"@max_yyyyq\") = 19993\n        Set rstADO = .Execute\n    End With\n\nThis avoids using our ODBC SQL syntax entirely. However this form uses the ODBC SQL syntax:\n\n    With cmdADO\n        Set .ActiveConnection = objADO.Connection\n        .CommandText = \"{call get_cust_dates(1,19993)}\"\n        .CommandType = adCmdText\n        Set rstADO = .Execute\n    End With\n\nThis form requires less parsing by the RPC protocol used by SQLOLEDB (the Provider for SQL 7). However, this form makes it \"harder\" to Execute the Command with different parameters. (\"Harder\" means understanding the concept of \"parameter markers\" or string handling via the Replace() function.) I don't use the Command object to open Forward-only, Read-only Recordsets; I use the Connection object. For more information please see SQL 7 Books Online; search for \"Calling a Stored Procedure (OLE DB).\"\n\n\n\nThe NextRecordset Method\n\nI am sure that only a select few DAO programmers know that the NextRecordset Method was available in ODBCDirect Workspaces. I never used it. I must make mention of it because it is indirectly related to a fundamental misunderstanding I had about ADO Recordsets returned from SQLOLEDB. I thought ADO was unfinished or \"broken.\" The only Provider I trusted was the OLE DB Provider for ODBC (MSDASQL). If I tried to use a \"native\" SQL Server Provider it would occasionally return closed (State = adStateClosed).\n\nIt took me over a year (experimenting off and on) to discover that on those \"occasions\" when the Recordsets came back closed the Recordset was based on a stored procedure SELECTing from a temporary table. This was quite a revelation for me. Microsoft knew this all along. For more details please see MS KB Article Q235340 (\"PRB: Error Messaging Referencing #Temp Table with ADO-SQLOLEDB.\")\n\nMicrosoft says this behavior is by design. To stop this behavior send the command SET NOCOUNT ON before the stored proc' is run. The reason why this behavior is by design is because SQLOLEDB Providers can return multiple Recordsets. If you have ever run a stored proc' from the SQL 7 Query Analyzer and noticed multiple \"Records Affected\" messages return during execution, then it would not be unreasonable to say that SQLOLEDB \"sees\" this as well. It follows that ADO's NextRecordet Method can be used for such a stored proc'.\n\nAs of this writing I am not certain that I will be using the NextRecordset Method since there is a problem using this method when a connection is closed. I will keep my eyes open. For more details see MS KB article Q193352 (\"PRB: NextRecordet fails When Called On a Disconnected Recordset\").\n\n\nThe PageSize, PageCount and AbsolutePage Properties\n\nI have yet to use these properties but I know I will. This is why I recommend taking a look at MS KB article Q202125 (\"HOWTO: Page Through a Recordset from ASP\").",
  "Tag": "kb-2025630760"
}