{
  "Document": {
    "DocumentId": -590504244,
    "Title": "GETTING VITAMIN C FROM FOODS, NOT PILLS",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2004-05-21T17:23:55.483",
    "ModificationDate": "2004-05-21T17:23:55.483",
    "TemplateId": null,
    "SegmentId": 81,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "Although there is current discussion to more than double the current 60 milligram recommendation for vitamin C to help protect against some diseases and degenerative effects of aging, you should turn to fruits and vegetables instead of supplements to bump up your intake.   \n\nMany fruits and vegetables are naturally rich in vitamin C, as well as other important vitamins, minerals, and fiber. So go natural--make consuming five servings of fruits and vegetables a daily commitment.  \n\nFoods naturally rich in vitamin C: \n\nStrawberries: 1 cup, sliced; 95 mg \nRed or green pepper, raw: 1/2 cup; 65 mg  \nPapaya: 1 cup, cubed; 85 mg \nRed or green pepper, cooked: 1/2 cup; 50 mg  \nKiwi: 1 medium; 75 mg \nBroccoli, cooked: 1/2 cup; 60 mg \nOrange: 1 medium; 70 mg \nKale, cooked: 1 cup; 55 mg \nCantaloupe: 1/4 medium; 60 mg \nBrussels sprouts, cooked: 1/2 cup; 50 mg \nOrange juice: 1/2 cup; 50 mg \nPotato, baked, with skin: 1 medium; 25 mg \nMango: 1 cup, sliced; 45 mg \nGrapefruit: 1/2 medium; 40 mg \nGrapefruit juice: 1/2 cup; 35 mg \n\nIn addition to easily providing between 100 to 200 milligrams of vitamin C, consuming five servings of fruits and vegetables each day provides other important and disease-fighting vitamins, minerals, and fiber. Studies have shown that people who consume diets providing 200 milligrams of vitamin C per day through fruits and vegetables have a lower incidence of some cancers, especially cancers of the oral cavity, esophagus, stomach, colon, and lung. However, people who simply consume vitamin C supplements do not appear to experience the same protective effect.",
  "Tag": "kb-590504244"
}