{
  "Document": {
    "DocumentId": 2076072261,
    "Title": "WordPress CSS; WordPress Codex",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2009-09-19T21:59:31",
    "ModificationDate": "2009-09-19T21:59:31",
    "TemplateId": null,
    "SegmentId": 67,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "WordPress relies heavily on the presentation styles within CSS. With the introduction of WordPress v1.5 Themes, your layout options haven't just expanded, they've exploded! WordPress has made it easier than ever to change your website look, and opened up the field even more to help you create your own Theme and page layout.\n\nCSS stands for Cascading Style Sheets. It allows you to store style presentation information (like colors and layout) separate from your HTML structure. This allows precision control of your website layout and makes your pages faster and easier to update.\n\nThis article briefly describes the use of CSS in WordPress, and lists some references for further information. For information on CSS itself, see Know Your Sources#CSS.\n\nWordPress and CSS\n\nWordPress Themes use a combination of template files, template tags, and CSS style sheets to generate your WordPress site's look.\n\nTemplate Files \n    Template files are the building blocks which come together to create your site. In the WordPress Theme structure, the header, sidebar, content, and footer are all contained within individual files. They join together to create your page. This allows you to customize the building blocks. For example, in the Default WordPress Theme, the multi-post view found on the front page, category, archives, and search web pages on your site, the sidebar is present. Click on any post, you will be taken to the single post view and the sidebar will now be gone. You can choose which parts and pieces appear on your page, and customize them individually, allowing for a different header or sidebar to appear on all pages within a specific category. And more. For a more extensive introduction to Templates, see Stepping Into Templates. \n\nTemplate Tags \n    Template tags are the bits of code which provide instructions and requests for information stored within the WordPress database. Some of these are highly configurable, allowing you to customize the date, time, lists, and other elements displayed on your website. You can learn more about template tags in Stepping Into Template Tags. \n\nCSS Style Sheets \n    This is where it all comes together. On every template file within your site, there are XHTML tags and CSS references wrapped around your template tags and content. In the style sheet within each Theme are commands for the page's structure. Without these instructions, your page would simply look like a long typed page. With these instructions, you can move the building block structures around, making your header very long and filled with graphics or photographs, or simple and narrow. Your site can \"float\" in the middle of the viewer's screen with space on the left and right, or stretch across the screen, filling the whole page. Your sidebar can be on the right or left, or even start midway down the page. How you style your page is up to you. But the instructions for styling are found in the style.css file within each Theme folder. \n\nWordPress Generated Classes\n\nSeveral classes for aligning images and block elements (DIV, P, TABLE etc.) were introduced in WordPress 2.5: aligncenter, alignleft and alignright. In addition the class alignnone is added to images that are not aligned, so they can be styled differently if needed.\n\nThe same classes are used to align images that have a caption (as of WordPress 2.6). Three additional CSS classes are needed for the captions, together the alignment and caption classes are:\n\n.aligncenter,\ndiv.aligncenter {\n   display: block;\n   margin-left: auto;\n   margin-right: auto;\n}\n\n.alignleft {\n   float: left;\n}\n\n.alignright {\n   float: right;\n}\n\n.wp-caption {\n   border: 1px solid #ddd;\n   text-align: center;\n   background-color: #f3f3f3;\n   padding-top: 4px;\n   margin: 10px;\n   /* optional rounded corners for browsers that support it */\n   -moz-border-radius: 3px;\n   -khtml-border-radius: 3px;\n   -webkit-border-radius: 3px;\n   border-radius: 3px;\n}\n\n.wp-caption img {\n   margin: 0;\n   padding: 0;\n   border: 0 none;\n}\n\n.wp-caption p.wp-caption-text {\n   font-size: 11px;\n   line-height: 17px;\n   padding: 0 4px 5px;\n   margin: 0;\n}\n\nEach theme should have these or similar styles in its style.css file to be able to display images and captions properly.\n\nAdditionally, there are a few more WordPress class tags that you may optionally wish to style because they are generated by default:\n\n.categories {...}\n.cat-item {...}\n.current-cat {...}\n.current-cat-parent {...}\n.pagenav {...}\n.page_item {...}\n.current_page_item {...}\n.current_page_parent {...}\n.widget {...}\n.widget_text {...}\n.blogroll {...}\n.linkcat{...}\n\n\n[http://codex.wordpress.org/CSS]",
  "Tag": "kb2076072261"
}