{
  "Document": {
    "DocumentId": 2076072263,
    "Title": "WPF: “Converting a WPF FlowDocument to an XPS FixedDocument”; Derek Smythe",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2009-09-19T22:10:38",
    "ModificationDate": "2009-09-19T22:10:38",
    "TemplateId": null,
    "SegmentId": 83,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "FlowDocuments are to Windows applications what HTML pages are to web browsers. FlowDocuments allow you to produce and display information in a document style in such a way that allows the documents content to re-shape itself depending on display space and options; just think web page and browser and your on the right track.\n\nFixedDocuments on the other hand are to Windows applications what PDF's are to Adobe Reader. The emphasis of FixedDocuments is not in how the document is displayed but how it is printed.\n\nWith Windows Presentation Foundation a new document format called Xml Paper Specification (XPS) was introduced. This standard for describing document was combined with Open Packaging Convention (OPC) to produce a new, more open, approach to creating, printing, and storing documents.\n\nThis article describes how FlowDocuments can be converted to FixedDocuments (and XPS documents).\n\nFlowDocuments vs FixedDocuments\n\n\nFlowDocuments\nFlowDocuments are XAML files that describe in an XML language the content and format of a document. The syntax is very similar in nature to HTML pages. Here is an example:\n\n<FlowDocument x­mlns=\"http://schemas.microsoft.com/winfx/2006/xaml/presentation\"\n    ColumnWidth=\"400\" FontSize=\"14\" FontFamily=\"Georgia\">\n    <Paragraph>\n        This is\n        <Bold>my</Bold> paragraph. There are\n        <Italic>many</Italic> like it but this one is\n        <Bold>mine.</Bold>\n    </Paragraph>\n    <Paragraph>\n        FlowDocuments are to Windows applications... \n    </Paragraph>\n    <Paragraph>\n        FixedDocuments on the other hand are to Windows applications....\n    </Paragraph>\n</FlowDocument>\n\n\nThe above XML can be generated in a variety of ways and can also be stored in a variety of ways. For example, the FlowDocument could be produced with a XmlWriter or through a XSLT transformation, SqlServer query, and even produced through code as the example below shows.\n\n            FlowDocument flowDocument = new FlowDocument();\n\n            Paragraph para = new Paragraph();\n            para.Inlines.Add(new Run(\"This is \"));\n            para.Inlines.Add(new Bold(\"my \"));\n            para.Inlines.Add(new Run(\"paragraph. There are \"));\n            para.Inlines.Add(new Italic(\"many \"));\n            para.Inlines.Add(new Run(\"like it but this one is \"));\n            para.Inlines.Add(new Bold(\"mine.\"));\n\n\nIn terms of storing the FlowDocument the document is simply text and so it can be stored to file, to database, stored to resource, and so on. However since a FlowDocument can be decribed with XAML the document can compiled into a more efficient BAML representation and stored within an assembly.\n\nRemember that FlowDocuments are for displaying documents on screen in such a way as they adapt to the displays size and display options.\n\nSee FlowDocuments for more information.\n\nFixedDocuments\nIn contrast a FixedDocument is created following the guidelines described in the XPS specification, which is beyond the scope of this article. In brief a XPS/FixedDocument is a collection of XML files (that describe pages and content), Font files, and Image files that are all related in such a way as to describe the contents of the document.\n\nThe files that describe the document are all packaged up into a OPC paackage, which is a single file with a *.xps extension.\n\nIn terms of this article though FixedDocuments are designed for both printing the document or storing the document in a read-only state, similar like a PDF. The documents content is fixed because it doesn't adapt to suit display options.\n\nSee Writing a XPS Document for more information.\n\nSystem.Printing.XpsDocumentWriter\nThere are two classes responsible for converting a FlowDocument to a FixedDocument. These two classes are the System.Printing.XpsDocumentWriter class and the System.Windows.Documents.DocumentPaginator class.\n\nThe DocumentPaginator class (or a class that derives from it) is used to describe how the documents content is positioned and formatted on the FixedDocument.\n\nFor more information see Creating a custom DocumentPaginator\n\nThe XpsDocumentWriter class takes an instance of a DocumentPaginator class and uses it to write the documents content to XPS file. It does this in such a way that the resulting XPS file is fully compliant with the XPS specification.\n\nWhat makes the conversion between FlowDocument and a FixedDocument work is the fact that a DocumentPaginator can be directly created from a FlowDocument. The FlowDocuments DocumentPaginator is passed to XpsDocumentWriter and the conversion is done.\n\nYou need to add a reference to System.Printing.dll before using System.Printing.XpsDocumentWriter.\n\nCode Example\nYou need to add references to the following before the code below will work:\n\n    * ReachFramework.dll - contains all the classes necessary for working with XPS files.\n    * WindowsBase.dll - contains all the classes necessary for working with OPC packages\n    * System.Printing.dll - contains the XpsDocumentWriter class.\n    * PresentationCore.dll and PresentationFramework.dll - the WPF classes (FlowDocument, etc)\n\n\nThe first step is to get a FlowDocument. There are a number of ways to do this and it all depending on the format and location of the FlowDocument.\n\nIf the FlowDocument is stored as a loose XAML file, usually specified with BuildOption Content, then you can use the XamlReader class to read it in.\n\n            FlowDocument document = null;\n            using (FileStream fs = File.Open(\"docAsContent.xaml\", FileMode.Open))\n            {\n                document = XamlReader.Load(fs) as FlowDocument;\n            }\n\n\nIf the FlowDocument was compiled into a BAML, usually specified with BuildOption Page, then you can use the static Application.LoadComponent method to read it.\n\n            FlowDocument document = null;\n            document = \n               Application.LoadComponent(new Uri(\"docAsBaml.xaml\", \n                                        UriKind.Relative)) as FlowDocument;\n\n\nThe next step, optional, is to display the generated XPS file. In order to this the DocumentViewer class is used. The following XAML shows a Window containing a DocumentViewer. In the code example that follows the generated XPS document will be displayed using this viewer.\n\n    <Window x:Class=\"WPFFlowDocToXPSFixedDoc.Window1\"\n        x­mlns=\"http://schemas.microsoft.com/winfx/2006/xaml/presentation\"\n        x­mlns:x=\"http://schemas.microsoft.com/winfx/2006/xaml\"\n        Title=\"Window1\" Height=\"300\" Width=\"300\">\n\n        <!-- DocumentViewer element is used to view Fixed Documents (XPS) -->\n        <DocumentViewer x:Name=\"xpsView\" />\n\n    </Window>\n\n\nFinally the conversion from FlowDocument to FixedDocument needs to be done. In order to do this you really need to think in terms of producing a XPS file. The process is really turn the FlowDocument to an XpsDocument and then turn the XpsDocument into a FixedDocument.\n\nSo FlowDocument to XpsDocument requires that a file is created, the XpsDocumentWriter then becomes a writer into that file. The content being written is the FlowDocuments DocumentPaginator.\n\nOnce the FlowDocument has been written to the XpsDocument a call to the XpsDocument.GetFixedDocumentSequence() is used to produce a FixedDocument and that is displayed in the DocumentViewer.\n\n        private void WriteXPS(FlowDocument flowDocument)\n        {\n            //generate temporary file name\n            string temp = System.IO.Path.GetTempFileName();\n            if (File.Exists(temp) == true)\n                File.Delete(temp);\n\n            //create a XPS document \n            XpsDocument xpsDoc = new XpsDocument(temp, FileAccess.ReadWrite);\n\n            //create a XPS document writer that writes to the XPS document\n            XpsDocumentWriter xpsWriter = XpsDocument.CreateXpsDocumentWriter(xpsDoc);\n\n            //write the flow document to the XPS document\n            //   use the flow documents default DocumentPaginator to do that\n            xpsWriter.Write((flowDocument as IDocumentPaginatorSource).DocumentPaginator);\n\n            //display the XPS document in the DocumentViewer\n            //   use the GetFixedDocumentSequence method to return a \n            //   FixedDocument representation of the XPS file\n            xpsView.Document = xpsDoc.GetFixedDocumentSequence();\n\n            //close the XPS file\n            xpsDoc.Close();\n        }\n\n[http://www.dsmyth.net/wiki/StudyNotes_WPFFlowDocToXPSFixedDoc.ashx]",
  "Tag": "kb2076072263"
}