{
  "Document": {
    "DocumentId": 2076071608,
    "Title": "Windows Server 2003: Windows Update Problem; Error 0x800C0008; \"a discrepancy in your computer's time setting\" message",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2004-10-16T18:30:39.73",
    "ModificationDate": "2004-10-16T18:30:39.73",
    "TemplateId": null,
    "SegmentId": 79,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "Windows Update produced the following error:\n\n    Windows Update has encountered an error.\n    This may be due to a discrepancy\n    in your computer's time setting.\n\n    To check your date and time setting:\n\n        1. On the taskbar, double-click the time.\n        2. Verify that the date and time is correct.\n\n    Send error number to Microsoft (0x800C0008)\n\nThis problem appears to be related to Microsoft's Windows 2003 team not being sufficiently intimate with the Windows Update Team and possibly the IE team. I suspect this because when I loaded windows update using this address:\n\n    https://v4.windowsupdate.microsoft.com/en/default.asp\n\nThe site works as expected. However, as of this writing, linking to the http version of this site still produces the error. This error should not happen at all. In my mind there is the following uninformed expectations:\n\n* Windows 2003 should \"secure\" Internet Explorer but should automatically place Windows Update site(s) on the list of \"trusted\" sites.\n\n* Whenever there is an error, there should be a \"clean re-install\" option available for Windows Update. I cannot imagine that this is not possible.\n\n* There should be a downloadable Windows Update utility that can verify that everything is working okay. Why do I feel like I am indulging in fantasy?\n\n* How about this fantasy: there should be a Windows Update Server sold like an internet router sitting on the network pushing these updates to clients. It can be an \"x box\" for the rest of us.",
  "Tag": "kb2076071608"
}