{
  "Document": {
    "DocumentId": 2076072153,
    "Title": "E4X and ActionScript: “Using XML Namespaces with E4X and ActionScript 3” by Darron Schall",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2009-07-27T22:08:55",
    "ModificationDate": "2009-07-27T22:08:55",
    "TemplateId": null,
    "SegmentId": 84,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "\n    import mx.rpc.events.ResultEvent;\n\n    [Bindable]\n    public var rockArtists:XMLList;\n\n    // Define the namespace used in the rss feed for \"itms\".  Note that the\n    // namespace we define is \"items\" instead.  These values do not need\n    // to be the same, but generally should be for readability purposes.\n    namespace items = \"http://phobos.apple.com/rss/1.0/modules/itms/\";\n\n    private function onResult( event:ResultEvent ):void {  \n        var rss:XML = event.result as XML;  \n \n        // Filter the feed by the Rock category  \n        var rock:XMLList = rss.channel.item.(category == \"Rock\");  \n\n        // Use \"items\" namespace prefix (corresponding to the namespace we  \n        // defined above) to access the artist elements  \n        //rockArtists = rock.items::artist;  \n        // Or, alternatively:  \n        use namespace items;  \n        rockArtists = rock.artist;  \n    }\n\n…\n\nThe key here is that the artist element nodes are created with <itms:artist> in the RSS feed. In the XML, the \"itms\" namespace is defined as x­mlns:itms=\"http://phobos.apple.com/rss/1.0/modules/itms/\". This namespace is re-created in ActionScript using the namespace keyword in ActionScript, but instead of calling it \"itms\" it is defined as \"items\". In general, you'd want to keep the prefix the same for both, but for illustration purposes you can see that they're allowed to be different.\n\nAccessing the artist element nodes then is simply a matter of using the namespace via use namespace items and asking for just the artist (without the namespace prefix). Another approach is to omit the use namespace ... code and use the namespace prefix directly: rock.items::artist. In both cases, the namespace to use is the one defined in ActionScript, and not the one defined in the XML file (so \"items\" instead of \"itms\").\n\n[http://www.darronschall.com/weblog/2006/04/\n    using-xml-namespaces-with-e4x-and-actionscript-3.cfm]",
  "Tag": "kb2076072153"
}