{
  "Document": {
    "DocumentId": 2076072375,
    "Title": "Silverlight 3.x Plug-In Parameters; Laurent Duveau",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2010-05-04T21:45:14",
    "ModificationDate": "2010-05-04T21:45:14",
    "TemplateId": null,
    "SegmentId": 83,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "allowHtmlPopupWindow [Boolean]\n\nSpecifies whether the HtmlPage.PopupWindow  method is allowed. Defaults to true for applications in the same domain, otherwise false.\n\n\nautoUpgrade [Boolean]\n\nSpecifies whether the plug-in should attempt to upgrade if minRuntimeVersion is newer than the current Silverlight version. Default is true.\n\n\nbackground [Color with or without alpha (RGB, ScRGB)]\n\nPlug-in background color. Default is null (white).\n\n\nenableAutoZoom [Boolean]\n\nIndicates whether the host (for certain platforms) can invoke zoom behavior that increases the DPI. Default is true.\n\n\nenableCacheVisualization [Boolean]\n\nIndicates whether to use a non-production analysis visualization mode, which shows areas of a page that are being GPU accelerated with a colored overlay. Default is false. Do not use in production code.\n\n\nenableFramerateCounter [Boolean]\n\nIndicates whether to display the current frame rate in the hosting browser's status bar (IE/Win only).\n\n\nenableGPUAcceleration [Boolean]\n\nIndicates whether to use graphics processor unit (GPU) hardware acceleration for cached compositions, which potentially results in graphics optimization. (false by default)\n\n\nenablehtmlaccess [Boolean]\n\nSpecifies whether the plug-in has full access to the browser DOM. Defaults to true for applications in the same domain, otherwise false.\n\n\nenableNavigation ['all' | 'none']\n\nIndicates whether the hosted content in the Silverlight plug-in can use a HyperlinkButton to navigate to external URIs. Default is all. \t\n\n    all: the hosted content can use HyperlinkButton to navigate to any URI.\n\n    none: the hosted content cannot use HyperlinkButton for navigation to an external URI. Relative URIs for internal navigation are still permitted.\n\n\nenableRedrawRegions [Boolean]\n\nDetermines whether to visually indicate the areas of the plug-in that are being redrawn with each frame. This property is for performance tuning and visualization during development only; do not specify it for any deployed Silverlight-based application. Default is false.\n\n\ninitParams \n\nUser-defined string of parameters. \tComma separated key=value pairs\n\n\nmaxframerate [Integer]\n\nSpecifies the maximum number of frames per second that the plug-in can render. The default is 60.\n\n\nminRuntimeVersion \n\nSpecifies the earliest version of the Silverlight plug-in required. \tVersion number\n\n\nonError [JavaScript function name]\n\nError handler for parse and native code run-time errors.\n\n\nonFullScreenChanged [JavaScript function name]\n\nFunction to call when the FullScreen property changes.\n\n\nonLoad [JavaScript function name]\n\nFunction to call when the plug-in has finished loading in the DOM.\n\n\nonResize [JavaScript function name]\n\nFunction to call when the plug-in size changes.\n\n\nonSourceDownloadComplete [JavaScript function name]\n\nFunction to call when the source download has completed.\n\n\nonSourceDownloadProgressChanged [JavaScript function name]\n\nFunction to call when the source download progress changes.\n\n\nonZoom [JavaScript function name]\n\nSpecifies the handler for a Zoomed event that occurs when the Silverlight plug-in content area receives a host-generated zoom event.\n\n\nsource  [URI]\n\nSpecifies the address or relative path of either an initial XAML file or XAP.\n\n\nsplashScreenSource [URI]\n\nSpecifies a XAML page to use as the splash screen.\n\n\nwindowless [Boolean]\n\nSpecifies the rendering mode for the plug-in for Windows versions of Silverlight. The default is false.\n\n[http://weblogs.asp.net/lduveau/archive/2009/07/22/silverlight-3-object-tag-param-list-aka-where-is-my-asp-silverlight-control.aspx]\n",
  "Tag": "kb2076072375"
}