{
  "Document": {
    "DocumentId": 2076071509,
    "Title": ".NET Framework: Runtime Security Policy for Local Intranet Zone; Internet Explorer Internet Properties",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2003-02-12T11:30:40",
    "ModificationDate": "2003-02-12T11:30:40",
    "TemplateId": null,
    "SegmentId": 83,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "As of the create date of this writing, I am slowly but slowly migrating \"classic\" ASP to .NET solutions. In the mean time, each IIS Server on my Local Intranet has a Visual Studio .NET Solution assigned to the entire web server built from the New Project in Existing Folder Template. I am not sure that this is the most elegant way to go, but  what I end up with is a Solution file with a Visual Basic.NET project covering the entire IIS server accompanied by Database Projects respective of each subfolder of the VB.NET project file (where each subfolder is actually an IIS web site but if I explain my reasoning behind this I will digress too far).\n\nThe bottom line is that I end up with one Visual Studio .NET Solution per machine in my Intranet. Now, since I do not want to edit these solutions on each machine, I have a single workstation pulling these files using the ancient file:/// protocol. By default, VS.NET on my workstation does not trust these solutions so I get my familiar \"The project location is not fully trusted by the .NET runtime…\" message. The quick and dirty way to avoid this message is to open .NET Configuration and select:\n\n    My Computer > Runtime Security Policy > Machine > Code Groups\n        > All_Code > LocalIntranet_Zone\n\nand create a Child Code Group with Membership Condition type set to Zone where Zone is set to Local Intranet and Permission Set is FullTrust. Unfortunately, if you are in a large enterprise you many not want to trust every machine in the Local Intranet Zone.\n\nYou can redefine your Local Intranet Zone under Internet Explorer Internet Properties, the Security tab. Select Local Intranet and push the Sites… button. Uncheck Include all local…, Include all sites…, Include all network paths… and click on the Advanced… button. Under Add this Web site to the zone: enter the Intranet boxes you need; e.g. enter \\\\MyDevServer as file://MyDevServer.",
  "Tag": "kb2076071509"
}