{
  "Document": {
    "DocumentId": 2076072264,
    "Title": "SQL Server 2008 SSRS: “All those temporary files (RSTempFiles)”; John Gallardo, MSDN",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2009-09-19T22:13:02",
    "ModificationDate": "2009-09-19T22:13:02",
    "TemplateId": null,
    "SegmentId": 72,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "When you install Reporting Services, we create a few directories:\n\n   1. LogFiles\n   2. ReportManager\n   3. ReportServer\n   4. RSTempFiles\n\nMost of these are fairly self explanatory.  LogFiles... well we put our log files in there.  ReportManager contains the Report Manager application (what you get when you browse to http://<server>/reports) and ReportServer contains the Report Server application which is the proper 'Report Server' which implements our Web Service and HTTP handler endpoints... it is what you get when you go to http://<server>/reportserver.\n\nSo what about that RSTempFiles thing?  Well it contains files that are temporary of course!\n\nThese temporary files can be broken down into a few categories:\n\n    * Temporary Report Snapshot files.\n          o These files are only created if you have opted into using temporary file storage (see the WebServiceUseFileShareStorage).\n          o For RS2000/2005, snapshots are more or less completely independent and each is contained in its own directory (identified by a GUID).  Each snapshot contains a set of files (internally, they are referred to as \"chunks\"). \n          o For RS2008, snapshots oftentimes contain some shared data.  The folder-per-snapshot hierarchy used in RS2000/2005 is replaced by a single directory called \"Chunks.\"  Each chunk is a discrete file in this directory.\n          o These files are automatically cleaned up by the Report Server on a time-based interval (same as snapshot data stored in ReportServer and ReportServerTempDB catalog databases).\n    * Output/Intermediate Streams\n          o These files are all created directly within the the RSTempFiles directory.  There is no way to differentiate between these two sub-categories of files currently.\n          o Output streams - these streams are generated as output from the renderers.  The server spools them to disk if they grow large enough.  RS has an output cache that may cause these streams to survive beyond the lifetime of the request so that subsequent accesses can be served directly from the cache. \n          o Intermediate files - these files contain results of intermediate calculations during report processing and rendering.  Generally, these contain data which is never returned to the client, but rather holds temporary results in order to relieve memory pressure.  These files are cleaned up when the request completes (no caching across requests).\n    * Conversion files\n          o These are stored under a folder named _Conversion. \n          o Our compression format for snapshots changed between RS2000 and RS2005.  This folder would contain temporary files supporting the on-demand one-time upgrade of these persisted snapshots.  Unless you are upgrading from an RS2000 instance, you should never see this directory or files created.  \n    * Shadow Copy Files\n          o This is only for RS2008.\n          o After the CTP6 release of RS2008, we enabled shadow copy for our ASP.Net worker domains under the new hosting model.\n\n[http://blogs.msdn.com/jgalla/archive/2008/06/30/\n    all-those-temporary-files-rstempfiles.aspx]",
  "Tag": "kb2076072264"
}