{
  "Document": {
    "DocumentId": 2076072016,
    "Title": "Gerald Horne, Race War!; Chapter 5: War/Race; Du Bois on Pre-Communist China; pp. 110–111",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2008-08-28T19:38:16",
    "ModificationDate": "2008-08-28T19:38:16",
    "TemplateId": null,
    "SegmentId": 86,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "While Du Bois in his later years became a devoted admirer of Communist-Ruled China, in the 1930s his irascibility in discussing the Chinese knew no bounds. They were “extremely separatist,” he thought. “They do not know Europe. They have no idea of human cruelty…current in Europe. China does not even realize the insult of the American Chinese Exclusion Act,” he said in amazement. But Japan was different, he felt. Du Bois, a socialist of sorts and a friend of Soviet Russia, sought to reconcile this nation with Japan as this unlikely prospect steadily slipped away in reality.\n\nDu Bois tended to see the Japanese as robust in their encounter with white supremacy and Chinese as pusillanimous—a notion that was confirmed in his mind when he visited Shanghai in 1936. When he raised the question of racial indignities with the Chinese leaders—who had just denounced Japanese aggression in their country—they “made no reply… They talked long, but they did not really answer my question” concerning Anglo-American outrages. Du Bois, like other Negroes, found China’s abrasive approach toward Japan and mildness toward the Empire rather curious; it reminded many blacks of a distasteful phenomenon in the United States where certain Negroes were fire-breathing combatants toward their own kind but timorous when dealing with Euro-Americans.\n\nThis suspicion of China and the Chinese as being much too quick to seek accommodation and collaboration with the “white” powers, as opposed to Japan, which was seen by contrast as utterly confrontational, soured many Negroes on the Middle Kingdom. During this 1936 visit to Shanghai, Du Bois recalled “sitting with a group of Chinese leaders at lunch.” Rather “tentatively,” he told them that he “could well understand the Chinese attitude toward Japan, its bitterness and determined opposition to the substitution of Asiatic for an European imperialism.” Yet what he “could not understand was the seemingly placid attitude of the Chinese toward Britain.” Indeed, he thought “the fundamental source of Sino-Japanese enmity was in China’s ‘submission to white aggression and Japanese resistance to it.’” The Chinese, he thought, were “Asian Uncle Toms of the ‘same spirit that animates the ‘white folks’ nigger’ in the United States.” With a wave of the hand, Du Bois dismissed concerns about violation of Chinese sovereignty by Japan. “In 1841,” he argued, “the English seized Hong Kong, China with far less right than the Japanese had in seizing [Manchuria].”\n",
  "Tag": "kb2076072016"
}