{
  "Document": {
    "DocumentId": 2076072021,
    "Title": "Gerald Horne, Race War!; Chapter 2: The Asiatic Black Man?; American and Japanese Fiction about a Japanese Invasion of the U.S.; pp.49–50",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2008-08-29T20:29:36",
    "ModificationDate": "2008-08-29T20:29:36",
    "TemplateId": null,
    "SegmentId": 86,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "Japan-related themes were a frequent staple of black writers in the wake of the 1905 victory, with revenge against white supremacy as a repetitive theme. In 1913 James Corrothers wrote a story in the *Crisis*, journal of the National Association for the Advancement of Colored People (NAACP), that “situated the problems of black leadership within global affairs by imagining a military alliance of Japan and Mexico against the United States, further supported by black deserters from the U.S. Army and the secession of Hawaii, led by angry Japanese-Americans.” The U.S. president had to appeal to “Jed Blackburn,” a Jack Johnson type character who “led a force of ten thousand black soldiers on a suicidal counterattack of Japan’s invasion of Southern California.” J.E. Bruce was another black writer who wrote wishful fiction about Japan defeating the United States militarily. In his plot, the U.S. president had to call for volunteers to prevent this defeat, which led to a reduction in racism against African Americans who were now pivotal to national security—a scenario not far distant from what occurred during the Pacific War and the Cold War.\n\nThis work of propaganda was matched, if not exceeded, by the 1921 potboiler by Japanese General Sato Kojiro, *Japanese-American War*. This book imagined the surprise destruction of the U.S. Pacific fleet, the occupation of Hawaii, and an invasion by Japanese forces of the U.S. mainland supported by 10 million Negroes led by Marcus Garvey.\n",
  "Tag": "kb2076072021"
}