{
  "Document": {
    "DocumentId": 2076072216,
    "Title": "PowerShell: “Even More Things You Can Do With Arrays”",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2009-08-26T17:34:25",
    "ModificationDate": "2009-08-26T17:34:25",
    "TemplateId": null,
    "SegmentId": 83,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "One of the very first things people notice about Windows PowerShell is this: PowerShell makes it very easy to create arrays and to add new items to arrays. With VBScript, these same tasks are a bit … challenging … to say the least: you either have to declare the array size in advance (leaving you with an array that can’t be resized), or you have to declare a dynamic array, then resize that array each time you add a new item. (Taking care, of course, to preserve all the existing items in the array.) Sure that sounds like a lot of fun. But, trust us: it’s not\n\nWith Windows PowerShell, however, things are much different, and much easier. Want to create an array named $a, an array that contains the values 1, 2, and 3? Okey-doke:\n\n$a = 1, 2, 3\n\nThat’s all you have to do: just separate the items using commas and add them all to the array in one fell swoop. Can you create an array of string values using this same approach? Of course you can; just make sure you enclose the string values in double quote marks:\n\n$a = \"one\", \"two\", \"three\"\n\nAh, good question: what if you do want to add a new item to the array? No problem; this line of code will do the trick:\n\n$a = $a + 4\n\nIf $a formerly contained the values 1, 2, and 3, what do you suppose $a will be equal to now? You’re absolutely right:\n\n1\n2\n3\n4\n\nSo is this the easiest thing you’ll ever do in your entire life? Probably; we can’t think of too may things that are easier.\n\nOf course, because creating new arrays and adding items to existing arrays is so easy you might think you know everything there is to know about arrays in Windows PowerShell. Is that really true? Well, maybe; let’s find out for ourselves.\n\n[http://www.microsoft.com/technet/\n    scriptcenter/resources/pstips/aug07/pstip0803.mspx]",
  "Tag": "kb2076072216"
}