{
  "Document": {
    "DocumentId": 2076071948,
    "Title": "M. E. Chevreul; The Principles of Harmony and Contrast of Colors and Their Applications to the Arts; Glossary; p. 47",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2008-03-20T21:12:28",
    "ModificationDate": "2008-03-20T21:12:28",
    "TemplateId": null,
    "SegmentId": 62,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "Chevreul’s Terminology\n\nAccidental Colors—this term refers to afterimages and to color sensations experienced subjectively.\n\nBinary Colors—colors compounded or made up of two primaries, or groups of two colors.\n\nBroken Colors—pure colors mixed with black.\n\nBroken Tones—pure colors mixed with white.\n\nComplementary Colors—red-green, yellow-violet, orange-blue.\n\nCompound Colors—colors compounded of primaries.\n\nContiguous—side by side, in close proximity.\n\nHeight, Height of Tone—the lightness or darkness of colors. Yellow and pink are colors of high tone, while violet and olive are colors of low tone.\n\nIntensity—a term commonly used by Chevreul in a rather loose way to indicate purity or brightness in color.\n\nLuminous Colors—red, orange, yellow, bright green.\n\nMixed Contrast—the influence of afterimages on other colors. Also the visual mixture or diffusion of colors on the retina of the eye.\n\nPrimary Colors—red, yellow, blue.\n\nScales—variations or sequences of chromatic colors (hue scales) or sequence of a color toward white or black (tone scales).\n\nSecondary Colors—orange, green, violet.\n\nShades—colors mixed with black.\n\nSimultaneous Contrast—the visual influence of colors in close proximity to one another when viewed at the same time.\n\nSomber Colors—blue and violet.\n\nSuccessive Contrast—the visual influence of colors on each other when viewed separately after short periods of time.\n\nTernary—groups of three colors.\n\nTertiary Colors—grayed colors, such as russet, citrine, olive, (Usually, the colors that result from mixtures of secondaries, orange, green violet.)\n\nTints—colors mixed with white.\n\nTones—one of the most broadly used terms of Chevreul to indicate variations and graduations that result from the dilution of a pure color with white or black.\n",
  "Tag": "kb2076071948"
}