{
  "Document": {
    "DocumentId": 2076071701,
    "Title": "MCAD/MCSD Notes: Chapter 8, Lesson 2; Using Windows Authentication",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2005-08-30T18:21:15.797",
    "ModificationDate": "2005-08-30T18:21:15.797",
    "TemplateId": null,
    "SegmentId": 83,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "Lesson 2: Using Windows Authentication\n\nThe purpose of this lesson is to show the relationship between Windows (or NTLM) authentication and ASP.NET. This lesson also delves into the concept of impersonation.\n\n* \"Windows authentication is the default authentication method when you create a new Web application project.\"\n\nThis Web application configuration denies anonymous users:\n\n    <authentication mode=\"Windows\"/>\n    <authorization>\n        <deny users=\"?\"/>\n        <!-- Deny unauthenticated users -->\n    </authorization>\n\nFor more information on authentication configuration see:\n\n    http://msdn.microsoft.com/library/en-us/\n        cpgenref/html/gngrfauthorizationsection.asp\n\n* \"If impersonation is enabled, the application executes using the permissions found in your user account. Otherwise, the application executes using the limited ASPNET user account... When a user is authorized, ASP.NET issues an authorization certificate in the form of a cookie that persists for the duration of the user's session.\"\n\nKeep in mind that the impersonated credentials must have the same rights as the \"limited\" ASPNET account otherwise lack of access to folders like \\Temporary ASP.NET Files will cause exceptions. For more details, see \"How To: Create a Custom Account to Run ASP.NET\" by J.D. Meier, Alex Mackman, Michael Dunner and Srinath Vasireddy here:\n\n    http://msdn.microsoft.com/library/en-us/dnnetsec/html/SecNetHT01.asp\n\n* \"When a user is authorized, ASP.NET issues a certificate in the form of a cookie that persists for the duration of the user's session.\"\n\nThe speculation here suggests that this certificate \"persists\" elsewhere when cookie-less sessions are enabled.\n\n* \"One of the key advantages of Windows authentication is that users who are logged on to the network don't have to log on again to access the Web application.\"\n\nThis feature is best enjoyed in a domain-based Intranet setting using Microsoft Web browsers.\n\n* \"To restrict access to specific users, list their names separated by commas in an <allow> element.\"\n\nThis is the example:\n\n    <authorization>\n        <allow users=\"contoso\\DeannaMeyer,contoso\\MichaelEmanuel\" />\n        <deny users=\"*\" />\n    </authorization>\n\n* \"To allow or deny access to certain groups of users, add the <roles> element to the authorization list...\"\n\nThis is the example:\n\n    <authorization>\n        <allow roles=\"contoso\\Administrators\" />\n        <deny users=\"*\" />\n    </authorization>\n\n* \"The Identity property returns an object that includes the user name and role information...\"\n\nThe Identity property is a member of System.Web.UI.Page.User.\n\n* \"These methods and properties can be used in conjunction with the Global module's AuthorizeRequest event to check user names against an external user file rather than use the list in Web.config.\"\n\nThis topic seems to be connected with HTTP Modules such as in \"INFO: ASP.NET HTTP Modules and HTTP Handlers Overview\" at:\n\n    http://support.microsoft.com/default.aspx?scid=kb;EN-US;Q307985\n\n* \"If authorization is set both in Web.config and in IIS, the IIS setting is evaluated first...\"\n\nBecause the \"most restrictive\" setting is used the order of events here seems irrelevant.\n\n* \"Allowing IIS to control the password for the anonymous account is highly recommended, but this setting might need to be overridden if your application is deployed over multiple servers.\"\n\nThis recommendation must also be weighed against the MSKB article \"Password Synchronization/Allow IIS to Control Password May Cause Problems\" at:\n\n    http://support.microsoft.com/default.aspx?scid=kb;en-us;Q216828\n\n* \"...you can enable multiple authentication methods through IIS...you can detect which method was used to authenticate a user in code by using the Identity object's AuthenticationType method...\"\n\n* \"...once a user is authenticated, the application runs under the identity of the ASP.NET user account by default.\"\n\nThis default behavior is changed by declaring the identity element with the form:\n\n    <configuration>\n        <system.web>\n            <identity impersonate=\"true\" />\n        </system.web>\n    </configuration>\n\nThe authenticated user that ASP.NET runs under must have the same (or more) security privileges as the ASP.NET user account. The WindowsIdentity.GetCurrent() method of System.Security.Principal can be used to verify the running account.\n\nASP.NET can also run under a single, known account with a configuration like this:\n\n    <configuration>\n        <system.web>\n            <identity impersonate=\"true\" userName=\"root\" password=\"jkdfjds#X5g\" />\n        </system.web>\n    </configuration>\n\nThis configuration (in a file called Web.config) can be placed in a subfolder of the Web application to define certain areas of the application that run under impersonation.",
  "Tag": "kb2076071701"
}