{
  "Document": {
    "DocumentId": 2076071794,
    "Title": "JavaServer Faces in Action Notes: Chapter 1; Introducing JavaServer Faces; 1.5.1 Dissecting hello.jsp",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2007-03-08T15:02:57",
    "ModificationDate": "2007-03-08T15:02:57",
    "TemplateId": null,
    "SegmentId": 69,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "1.5.1 Dissecting hello.jsp\n\nThe tag library indicated by http://java.sun.com/jsf/core provides for validation, event handling and the like.\n\nThe tag library indicated by http://java.sun.com/jsf/html provides for the JSF UI components like text boxes, output labels and forms.\n\n\"The <f:view> custom tag must enclose all other Faces-related tags...\"\n\nThe HtmlOutputText component, represented by the <h:outputText> tag, represents all read-only text generated by JSF. It follows that the HtmlOutputLabel component (<h:outputLabel>) encloses an <h:outputText> tag to display its data.\n\nThe HtmlMessage component (<h:message>) displays validation and conversion errors for a specific component, identified by its for attribute.\n\n#{helloBean.numControls} is an example of JSF Expression Language (EL) used to bind backing bean data to JSF components.\n\n\"Faces will automatically search the different scopes of the web application (request, session, application) for the specified backing bean.\"\n\n\"JSF also supports validators, which are responsible for making sure that the user enters an acceptable value.\"\n\nThe HtmlPanelGrid component renders as a <table> element.\n\nThe HtmlCommandButton has action and actionListener properties that can be bound to backing bean methods. The action method takes no parameters, and returns a String which is passed to the NavigationHandler. The actionListener method takes an ActionEvent parameter and has a return type of void.\n\nWhen HtmlCommandButton.immediate = true, this means that this component's value must be converted and validated during the Apply Request phase, rather than waiting for the Process Validations phase.",
  "Tag": "kb2076071794"
}