{
  "Document": {
    "DocumentId": 2076071610,
    "Title": "MCAD/MCSD Notes: Chapter 1, Lesson 1; Developing Web Applications",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2004-11-17T17:20:44.28",
    "ModificationDate": "2004-11-17T17:20:44.28",
    "TemplateId": null,
    "SegmentId": 83,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "Lesson 1: Types of Applications\n\nThe purpose of this lesson is to introduce ASP.NET and its supporting technologies (IIS, Visual Studio.NET, ADO.NET, the System.Web namespaces, The .NET Framework, etc.).\n\nASP.NET is used to build a specific type of application, the Web Application, which is distinguished from Web Service, Internet-enabled and Peer-to-peer applications. The suggestion is to visualize a number of clients receiving and sending messages into a cloud that represents the Internet and this cloud simultaneously is receiving and sending messages from a server where the ASP.NET application resides, running on IIS.\n\nIt follows that ASP.NET is featured in a client-server system design sending and receiving messages using the HTTP protocol and rendering UI in HTML. ASP.NET renders HTML dynamically and interactively opposed to \"traditional\" static HTML.\n\nVisual Studio.NET features two languages to support the development of web applications: C# and VB.NET. This does not mean that VS.NET does not support other languages. All this implies is that, as of the writing of this lesson, only C# and VB.NET are directly targeted by VS.NET productivity tools (e.g. Wizard commands).\n\nOne of the stated goals of this lesson was to describe the advantages ASP.NET has over less platform-specific technologies like CGI (the Common Gateway Interface). Outside of the subjective context of the popularity of Microsoft products, this goal was not achieved. This is not stated to suggest that such a goal is not achievable.",
  "Tag": "kb2076071610"
}