{
  "Document": {
    "DocumentId": 2076071684,
    "Title": "MCAD/MCSD Notes: Chapter 6, Lesson 3; Logging Exceptions",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2005-06-12T11:51:20.697",
    "ModificationDate": "2005-06-12T11:51:20.697",
    "TemplateId": null,
    "SegmentId": 83,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "Lesson 3: Logging Exceptions\n\nThe purpose of this lesson is to introduce ASP.NET Trace functionality to record Web application exceptions.\n\nIt appears that ASP.NET tracing is an excellent alternative to a formal, generic .NET exception-handling \"code block\" when you need to run the ASP.NET application with reduced security privileges since writing to the Application Event Log or writing to the file system could introduce unwanted security risks.\n\n* \"Tracing is a technique for recording events, such as exceptions, in an application.\"\n\nThis underscores the idea that tracing is not solely used for exception handling.\n\n* \"Building tracing into the .NET Framework ensures that programming techniques are the same across all the applications you develop with .NET Framework.\"\n\nThe lesson suggests that this functionality provides \"standardization\" for all solutions based on the .NET Framework. Since tracing features are defined in the System.Web.TraceContext class we are free to assume that this 'standard' is confined to ASP.NET applications (HTTP-dependent applications including Web services).\n\n* \"Tracing can be turned on or off for an entire Web application or for an individual page in the application...\"\n\nApplication-level tracing is controlled by declaring the trace element in the Web.config file. Page-level tracing is controlled by declaring the Trace attribute in the @ Page directive.\n\n* \"When you have set the @ Page directive's Trace attribute to True or False, you can't restore the default setting from the Properties window in Visual Studio .NET.\"\n\nIn effect, all tracing functionality is controlled through declarative programming. In procedural code, tracing status is read-only through the Trace.IsEnabled property.\n\n* \"The Trace object provides the Write and Warn methods to allow you to write messages to a request's trace information. The two methods are identical with one exception: messages written with Write are displayed in black, whereas messages written with Warn are displayed in red.\"\n\n* \"...if the <trace> element's PageOutput attribute is set to False in the Web.config file, trace output is written instead to the Trace.axd file in your application's root directory.\"\n\nThe speculation here is that Trace.axd is not a \"file\" but a dynamically generated resource called from a ASP.NET library.\n\n* \"By default, you can view Trace.axd only from the local server running the application.\"\n\nYou can allow remote viewing of Trace.axd by declaring the localOnly attribute of Trace.axd and setting it to false.\n\n* \"ASP.NET tracing stops after the server receives the number of HTTP requests entered in the <trace> element's RequestLimit attribute.\"\n\nWhen this attribute is not declared, note that the default request limit is 10. To reset the count against the limit send this URI: \"Trace.axd?clear=1\".",
  "Tag": "kb2076071684"
}