{
  "Document": {
    "DocumentId": 2076072240,
    "Title": "WSS: “Web Service Guidelines”; MSDN",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2009-09-08T21:49:14",
    "ModificationDate": "2009-09-08T21:49:14",
    "TemplateId": null,
    "SegmentId": 79,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "The Windows SharePoint Services Web services provided by the  Microsoft.SharePoint.SoapServer namespace include methods for accessing content on a Web site—such as for working with lists or site data—as well as methods for customizing meetings, imaging, document workspaces, or search.\n\nSOAP interfaces used in these services provide Microsoft .NET Framework developers with object models for creating solutions that work with Windows SharePoint Services remotely from a client or custom application. The interfaces are defined through the server-side object model of the Microsoft.SharePoint assembly, and their design is optimized to reduce the number of roundtrips transacted between client computer and server.\n\nMost Web services provide their functionality through the /_vti_bin virtual directory, which maps to the \\\\Program Files\\Common Files\\Microsoft Shared\\web Server extensions\\12\\ISAPI physical directory in the file system. The Administration Web service uses the /_vti_adm virtual directory, which maps to \\12\\ADMISAPI.\n\nNote:\n\nWindows SharePoint Services does not require the implementation of a particular version of SOAP. The SOAP response in any transaction with Windows SharePoint Services is managed by the .NET Framework.\n\nGuidelines\n\nYou can create a project in Microsoft Visual Studio 2005, such as a Windows application or console application, that uses a Windows SharePoint Services Web service to interact with SharePoint site and list data. For introductory information about creating a project in Visual Studio that works within the context of Windows SharePoint Services, see Getting Started with Programmatically Customizing a SharePoint Web Site in Visual Studio. After you create a project, you must set a reference to the Web service you want to implement in your code, specifying the full path to the Web service in relation to the site containing the data.\n\nTo add a reference to a Windows SharePoint Services Web service in Visual Studio\n\n1. In Solution Explorer, right-click References, and then click Add WebReference.\n\n2. In the Add Web Reference dialog box, for URL, type the absolute URL for the Web service in the following format: A path that includes the Web site for which the Web service will be available.\n\n    http://MyServer/[sites/][MySite/][MySubsite/]_vti_bin/Web_Service.asmx\n\nIf you are using methods in the Administration Web service, instead specify a path that goes to the administration port and that uses _vti_adm as the virtual directory, as follows:\n\n    http:// MyServer:Port_Number/_vti_adm/Admin.asmx\n\n3. Type a Web reference name, and then click Add Reference.\n\nInstantiating a Service\n\nInstantiate a Web service within code by using a constructor as follows:\n\n    Web_Reference_Name.Service_Name ServiceInstanceName =\n        new Web_Reference _Name.Service_Name();\n\nWeb_Reference_Name represents the name used for the reference to the Web service in Visual Studio, and Service_Name represents the name of the class providing methods that can be called through the Web service.\n\nEstablishing User Credentials\n\nTo establish system credentials for the current security context in which the application is running, add the following line after the previous line, which authenticates the user running the code by passing their default credentials to the Web service from the system credential cache. \n\n[http://msdn.microsoft.com/en-us/library/ms458094.aspx]",
  "Tag": "kb2076072240"
}