{
  "Document": {
    "DocumentId": 2076072296,
    "Title": "SQL Server CLR: “Regular Expressions in MS SQL Server 2005/2008”; CodeProject.com",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2009-10-06T08:57:54",
    "ModificationDate": "2009-10-06T08:57:54",
    "TemplateId": null,
    "SegmentId": 72,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "Reqular expressions in MS SQL Server 2005/2008. You can use all .Net Framework Regular Expressions stuff via MS Server CLR Integration. By the way you can use not only Regular Expressions from FCL.\n\nThis article describe how to create and use extension for LIKE (Transact-SQL) clause that supports regular expressions. Just for demo we also have created text parser that extracts tokens from text by given regular expression pattern. Also there is an overview of the namespaces and libraries required to compile database objects using the Microsoft SQL Server integration with the aid of .NET Framework common language runtime (CLR) as a whole.\nBackground\n\nStated material could be helpful if you know T-SQL and C#. In that case you can to wide library functionality. If you master T-SQL only (witout C#) you may just use RegExpLike function instead of standard LIKE clause in places where Regular Expressions functionality is needed.\nUsing the Code\nPart 1. Extension of LIKE clause\n\nAt the begin you have to allow MS SQL Server to use CLR Integration, i.e. to make possible usage of .Net assemblies and methods from them (by default this possibility is disabled). To do this use following script:\n\nsp_configure 'clr enabled', 1\nGO\nRECONFIGURE\nGO\n\nIf you want to revert defualt state run this script:\n\nsp_configure 'clr enabled', 0\nGO\nRECONFIGURE\nGO\n\nFrom here we create assembly that is Wrapper for Regular Expression .Net classes. To create user defined function for MS SQL Server in C#/.Net you have just to create library project, you create class, you add public static methods that will be SQL Function in future. And SqlFunctionAttribute must forestall each from these methods. It used to mark a method definition of a user-defined aggregate as a function in SQL Server. For our RegularExpressionLike method we have got method as shown:\n\n/// <summary>\n/// Class that allows to support regular expressions in MS SQL Server 2005/2008\n/// </summary>\npublic partial class SqlRegularExpressions\n{\t\n\t/// <summary>\n\t/// Checks string on match to regular expression\n\t/// </summary>\n\t/// <param name=\"text\">string to check</param>\n\t/// <param name=\"pattern\">regular expression</param>\n\t/// <returns>true - text consists match one at least, false - no matches</returns>\n\t[SqlFunction]\n\tpublic static bool Like(string text, string pattern)\n\t{\n\t\tMatch match = Regex.Match(text, pattern);\n\t\treturn (match.Value != String.Empty);\n\t}\n\t\n\t//...\n}\n\n\nNext step is assembly building. From now you have to deploy given assembly to MS SQL Server. To do this run next script (but you have to indicate path to assembly actual for your machine):\n\nCREATE ASSEMBLY \n--assembly name for references from SQL script\nSqlRegularExpressions \n-- assembly name and full path to assembly dll, SqlRegularExpressions in this case\nfrom 'd:\\Projects\\SqlRegularExpressions\\SqlRegularExpressions\\bin\\Release\\SqlRegularExpressions.dll' \nWITH PERMISSION_SET = SAFE\n\nBingo! Your assembly is registered and from now we may to use functionality from it. That is exactly what we plan do.\n\nBy the way to revert this action you can run script as following:\n\ndrop assembly \n--assembly name for references from SQL script\nSqlRegularExpressions \n\n\nTo bind assembly method with SQL Function you have to run script as shown:\n\n--function signature\nCREATE FUNCTION RegExpLike(@Text nvarchar(max), @Pattern nvarchar(255)) RETURNS BIT\n--function external name\nAS EXTERNAL NAME SqlRegularExpressions.SqlRegularExpressions.[Like]\n\nAnd that is all. Now you may use RegExpLike function to check string matching to pattern with regular expression:\n\n-- get all titles where title consists word that starts by 'A'\nselect * from titles\nwhere 1 = dbo.RegExpLike(title, '\\b(A\\S+)')   \n\n\n[http://www.codeproject.com/KB/database/\n    SqlRegularExpressions.aspx?display=Print]",
  "Tag": "kb2076072296"
}