{
  "Document": {
    "DocumentId": 2076071677,
    "Title": "MCAD/MCSD Notes: Chapter 5, Lesson 2; Using Data Sets on Web Forms",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2005-05-23T14:06:51.743",
    "ModificationDate": "2005-05-23T14:06:51.743",
    "TemplateId": null,
    "SegmentId": 83,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "Lesson 2: Using Data Sets on Web Forms\n\nThe purpose of this lesson is to detail the easiest ways to use the DataGrid and DataList controls, to bind data to other controls such as the DropDownList control and to briefly explore executing commands directly against a data connection.\n\n* \"The simplest way to display a data set on a Web form is through a DataGrid control using data binding.\"\n\nThe Visual Studio Web forms designer provides an interactive, design-time way to declare DataGrid display and editing functionality. Creating Template columns with Button columns, using the DataGrid Property Builder is the first step.\n\n* \"At run time, the DropDownList control displays a list... The limitation here is that you can include only one value for the list control's DataText and DataValue properties.\"\n\nThis is one example of how the Visual Studio .NET 1.x designer depends on code for \"advanced\" functionality.\n\n* \"...you can perform commands directly on a database connection.\"\n\nThese three methods are available from the database connection object: ExecuteScalar(), ExecuteNonQuery() and ExecuteReader().\n\n* \"Because any command that executes on a database has at least some potential to fail, you should always use exception handling... Calling the connection's Close method from a Finally/finally exception-handling clause ensures that the database connection is closed before the code continues.\"\n\nFor performance reasons, catching a \"context sensitive\" exception like InvalidOperationException or SqlException is best practice over dropping down to an Exception catcher.\n\n* \"The ExecuteNonQuery method acts directly on the database connection---it does not go through a data adapter or a data set... you must update any data sets affected by those changes by calling the Fill method on the adapter.\"\n\n* \"Using ExecuteReader to create data reader objects provides better performance than creating a data set from a data adapter object, but it doesn't provide you with much flexibility... A reader object locks the database connection while it is executing, so you should call the reader object's Close method when you have finished getting records...\"",
  "Tag": "kb2076071677"
}