{
  "Document": {
    "DocumentId": 2076071854,
    "Title": "Jomo Kenyatta, Facing Mount Kenya; Chapter 6: Initiation of Boys and Girls; Kenyatta on the custom of irua (clitoridectomy); pp. 125–126",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2007-06-30T22:45:05",
    "ModificationDate": "2007-06-30T22:45:05",
    "TemplateId": null,
    "SegmentId": 86,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "The custom of clitoridectomy of girls, which we are going to describe here, has been strongly attacked by a number of influential European agencies—missionary, sentimental pro-African, Government, educational and medical authorities. We think it necessary to give a short historical background of the method employed by these bodies in attacking the custom of clitoridectomy of girls.\n\nIn 1929, after several attempts to break down the custom, the Church of Scotland Mission to Gikuyu issued an order demanding that all their followers and those who wish their children to attend schools should pledge themselves that they will not in any way adhere to or support this custom, and they will not in any way let their children undergo the initiation rite. …Children of those who did not denounce the custom were debarred from attending the missionary schools.\n\n…\n\nNo proper Gikuyu would dream of marrying a girl who has not been circumcised, and vice versa. It is taboo for a Gikuyu man or woman to have sexual relations with someone who has not undergone this operation. …A few detribalised Gikuyu, while they are away from home for some years, have thought fit to denounce the custom and to marry uncircumcised girls, especially from coastal tribes, thinking they could bring them back to their fathers’ homes without offending the parents.\n\n…\n\nThe initiation of both sexes is the most important custom among the Gikuyu. It is looked upon as a deciding factor in giving a boy or girl the status of manhood or womanhood in the Gikuyu community.\n",
  "Tag": "kb2076071854"
}