{
  "Document": {
    "DocumentId": 2076071847,
    "Title": "James Henry Breasted, The Conquest of Civilization; XXV: World Dominion and Degeneracy; Breasted on Roman Governors and Publicans (c. 200B.C.); pp. 515–516",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2007-06-27T20:48:00",
    "ModificationDate": "2007-06-27T20:48:00",
    "TemplateId": null,
    "SegmentId": 86,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "Such a governor, enjoying unlimited power like that of an oriental sovereign, found himself far from home with Roman troops at his elbow awaiting his slightest command. He had complete control of all the taxes of the province, and he could take what he needed from its people to support his troops and the expenses of his government. He usually held office for a single year and was generally without experience in provincial government. His eagerness to gain a fortune in his short term of office and his complete ignorance of the needs of his province frequently reduced his government to a mere system of looting and robbery…\n\nThe effects of this situation were soon apparent in Italy. In the first place, the income of the Roman government was so enormously increased that it was no longer necessary to collect direct taxes from Roman citizens. This new wealth was not confined to the state. The spoils from the wars were usually taken by the victorious commanders and their troops. At the same time the provinces were soon filled with Roman business men. There were contractors, called publicans, who were allowed to collect taxes for the state at a great profit or gained the right to work state lands. We remember the common references to these publicans in the New testament, where they are regularly classified with “sinners.” With them came Roman money-lenders, who enriched themselves by loaning money at high rates of interest to the numerous provincials who were obliged to borrow to pay the extortionate taxes claimed by the Roman governors. The publicans were themselves money lenders, and all these men of money plundered the provinces worse than the greedy Roman governors themselves. As these people returned to Italy, there grew up a wealthy class such as had been unknown there before.\n",
  "Tag": "kb2076071847"
}