{
  "Document": {
    "DocumentId": 2076072019,
    "Title": "Gerald Horne, Race War!; Chapter 2: The Asiatic Black Man?; the Nation of Islam and the Empire of Japan; p.48 ",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2008-08-29T19:55:08",
    "ModificationDate": "2008-08-29T19:55:08",
    "TemplateId": null,
    "SegmentId": 86,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "Certainly the Nation of Islam, which began in Black America over seven decades ago and still remains potent, has been the heartiest of the Black Nationalist groups that originally had a pro-Tokyo orientation. From the beginning, stubborn rumors persisted that the notorious Japanese agent, Satohara Takahashi, was “bankrolling the NOI.” The Federal Bureau of Investigation charged  that these “Muslims and other black nationalists were receiving carbine rifles and sophisticated military weapons from Japanese espionage agents.” One Takahashi-sponsored group was “directed toward the extermination of the White Race” while “during meetings and services a large sign [was] always displayed bearing the inscription, ‘The Paleface Has to Go.’” Elijah Muhammad, a patron saint of the NOI, was actively engaged in these circles. He emphasized that “the Japanese will slaughter the white man… The Japanese are the brothers of the black man and the time will soon come when from the clouds hundreds of Japanese planes with the most poisonous gas will let their bombs fall on the United States and nothing will be left of it.” Like his “colored” counterparts in New Zealand—the Ratana, noted below—Elijah Muhammad also believed that he and his people were somehow related to the Japanese. “The Asiatic race is made up of all dark-skinned people,” he stated, “including the Japanese and the Asiatic black man.” The implication was clear, he thought: “Members of the Asiatic race must stick together.”\n",
  "Tag": "kb2076072019"
}