{
  "Document": {
    "DocumentId": 2076071532,
    "Title": "Microsoft JScript and MSHTML: The HTML Editor Application; HTA; MSDHTML",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2003-08-25T17:49:31",
    "ModificationDate": "2003-08-25T17:49:31",
    "TemplateId": null,
    "SegmentId": 67,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "Users of AOL mail and MSN Hotmail have been enjoying the one thing that makes the Microsoft Internet Explorer Web browser necessary: the ability to edit HTML in place. This was one of the original specifications Tim Berners-Lee (http://www.w3.org/People/Berners-Lee/) demanded in a web browser and Netscape failed to deliver. Microsoft on the other hand has it lurking about but its not really recognized as a feature worth heavily marketing let alone documenting.\n\nIn fact, the opinion here is that Microsoft would rather have you know about the HTML Application (featuring HTA files) before you learn about the MSDHTML (JScript) behind HTML Editing. This appears to be the case in MSDN's \"How to Create an HTML Editor Application\":\n\n    http://msdn.microsoft.com/\n        library/default.asp?\n            Url=/workshop/author/editing/tutorials/html_editor.asp\n\nI am sure there must be a better article, but theAngrycodeR (Sameers) did a great job showing off MSHTML editing in \"Creating an HTML Area Server Side Control\" at:\n\n    http://www.codeproject.com/aspnet/text_area_control.asp\n\nThe editor content is explained within the context of .NET server controls but just download the source code and dig out the file ...\\demo_RTFBox\\HTMLArea.html.\n\nThe key to all of this HTML editing stuff is the execCommand() method of the window.document object of MSDHTML. This is documented at MSDN:\n\n    http://msdn.microsoft.com/\n        library/default.asp?\n            Url=/workshop/author/dhtml/reference/methods/execcommand.asp\n\nAnd the most important caveat: never forget that this editor is based on MSHTML, Microsoft's implementation of HTML which has nothing to do with the wonderful standards set by the W3C. I was forced to use a lot of complex regular expressions to parse MSHTML into \"real\" HTML 4.x markup.",
  "Tag": "kb2076071532"
}