{
  "Document": {
    "DocumentId": 2076071625,
    "Title": "MCAD/MCSD Notes: Chapter 3, Lesson 1; Namespace Fundamentals",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2005-03-15T14:16:12.957",
    "ModificationDate": "2005-03-15T14:16:12.957",
    "TemplateId": null,
    "SegmentId": 83,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "Lesson 1: Namespace Fundamentals\n\nThe purpose of this lesson is to introduce the namespace and object oriented programming (OOP) concepts. I find this chapter confusing and aggressively asserting a Microsoft-centric view of OOP. I assume that I would not have so much trouble with this lesson when I am not aware of the famous achievements of Sun Microsystems!\n\n* \"Namespaces are a way of organizing code. They provide protection from conflicting names, sometimes called namespace collisions.\"\n\nNamespaces are imported with the using keyword in C# and the Imports keyword in VB.NET. References to namespaces outside of the current VS.NET project depends on the Project > Add Reference command.\n\n* \"Visual Studio projects store code in classes and modules.\"\n\nThe OOP concept of definition is in the use of the class keyword in C# and the Class/Module...End Class/Module blocks in VB.NET.\n\n* \"Visual Basic .NET and Visual C# use six key concepts for working with modules and classes.\"\n\nThese concepts are Definition, Access, Inheritance, Constructors and destructors, Delegates, and Abstract classes and interfaces. The opinion here is that two of these concepts, Inheritance and Abstract classes and interfaces, can be rolled up under polymorphism as suggested by the MSDN article \"Polymorphism in Components\" at:\n\n    http://msdn.microsoft.com/library/en-us/vbcon\n        /html/vbconImplementingInterfacesInComponents.asp\n\n* \"[In Visual C#] There are five levels of access to classes, modules and their members: public, protected, internal, protected internal and private.\"\n\nCorrespondingly, in VB.NET we have: Public, Protected, Friend, Protected Friend and Private.\n\nIt may be useful to associate the \"protection\" of members with inheritance, that the very presence of the protected keyword implies a design featuring inheritance.\n\n* \"[In Visual C#] Classes can inherit members from base classes and override or overload members of the inherited class.\"\n\nThe author's definition of inheritance for VB.NET deliberately does not use the term \"base class\" evidently because of its use of the Module... VB.NET inheritance has been awarded the feature called \"shadowing\" while C# appears to be coming up short. However, the C# Programmer's Reference covers the topic of the new modifier here:\n\n     http://msdn.microsoft.com/library/en-us/csspec/html/vclrfcsharpspec_10_2_2.asp\n\nThe author's code sample on page 107 uses the new modifier and is doing the equivalent of VB.NET's shadowing. The \"Overview of the Inheritance Keywords\" table on pages 102--103 finally shows this equivalence explicitly.\n\n* \"[In Visual C#]...Constructor methods have the same name as their class, and destructor methods use the class name preceded by a tilde (~).\"\n\nCorrespondingly, in VB.NET we have the New() and Finalize() methods.\n\n* \"[In Visual C#] The delegate keyword provides a safe way to call methods by their address rather than by their name. This is the .NET equivalent of a callback.\"\n\nCorrespondingly, in VB.NET we have the Delegate statement.\n\n* \"You can't inherit from more than one base class in a single derived class definition.\"\n\nAnother way to say this is that \"multiple inheritance\" is not supported by the .NET platform. When the author introduces this term there is also the first hint to the stereotypical VB6 programmer that there is another world out there beyond the realm of Microsoft using terms like multiple inheritance. I find that addressing this stereotypical audience in the book is more of an obstacle than not.\n\n* \"A derived class inherits the members of its base class. If the derived class defines a member with the same signature, the derived member overrides the base member. A member's signature includes its name, parameter list, parameter types, and return type.\"\n\nA derived member can overload or shadow the base member without regard to the base member's declaration. In C#, when a base member is declared as virtual (or Overridable in VB.NET), a derived member can override this base base member.\n\n* \"An abstract class is a class that defines an interface for derived classes. An abstract class is essentially a contract saying that all classes based on it will provide certain methods and properties.\"\n\nFor more information, see MSDN article \"Recommendations for Abstract Classes vs. Interfaces\" here:\n\n    http://msdn.microsoft.com/library/en-us/vbcon\n        /html/vbconAbstractClassesVersusInterfaces.asp\n\n* \"Delegates are types used to invoke one or more methods where the actual method invoked is determined at run time.\"\n\nFor more information, see MSDN article \"An Introduction to Delegates\" here:\n\n    http://msdn.microsoft.com/msdnmag/issues/01/04/net/default.aspx\n\n* \"Visual Basic .NET provides two ways to use a delegate.\"\n\nThe first pattern uses WithEvents and Handles keywords, which makes VB.NET backwards compatible with VB6. The second pattern uses AddHandler and RemoveHandler statements, which makes VB.NET syntax similar to C# delegate patterns.\n\n* \"Interfaces are similar to abstract classes... The difference is that interfaces don't provide any implementation of class members... The key here is that all items defined in the interface must exist in any class that implements the interface. If you omit any member, you get an error when you compile the code.\"",
  "Tag": "kb2076071625"
}