{
  "Document": {
    "DocumentId": 2076071619,
    "Title": "MCAD/MCSD Notes: Chapter 2, Lesson 2; Responding to Events",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2004-11-17T17:21:57.863",
    "ModificationDate": "2004-11-17T17:21:57.863",
    "TemplateId": null,
    "SegmentId": 83,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "Lesson 2: Responding to Events\n\nThe purpose of this lesson is detail Web application events from the page level to the application level. Dino Esposito further details the sequential, cyclical process of page-level events in \"The ASP.NET Page Object Model: One Day in the Life of an ASP.NET Web Page\" here:\n\n    http://msdn.microsoft.com/library/en-us\n        /dnaspp/html/aspnet-pageobjectmodel.asp\n\n* \"The life of a Web application begins when a browser requests the start page of the application.\"\n\nThis statement does not seem accurate. The assumption here is that the life of a Web application begins when a browser requests any page of the application. This level of accuracy takes into account what some call \"deep linking.\"\n\n* \"When the user stops using the Web application for a period of time (the default is 20 minutes), the user's session times out and ends.\"\n\nWhen all sessions end the application \"ends\" but because of .NET Framework garbage collection, \"...you don't know when an Application_End event will occur.\" For more details about Session State, see \"Session State\" at MSDN:\n\n    http://msdn.microsoft.com/library/en-us/cpguide/html/cpconSessionState.asp\n\n* \"The data that ASP.NET preserves between requests is called the Web form's view state.\"\n\nThis introduction of view state seems to serve only to introduce the words \"view state\" as the lesson moves on quickly to survey Application and Session \"state variables\" (yet another term that understandably avoids delving into the object collections of the underlying HttpApplicationState and HttpSessionState classes). More details at MSDN in \"ASP.NET State Management\" here:\n\n    http://msdn.microsoft.com/library/\n        en-us/cpguide/html/cpconaspstatemanagement.asp\n\n* \"Application state variables must be initialized in Visual C#...\"\n\nThe assumption here is that C# does not protect the developer against runtime errors caused by strong-typing collections of type object with casting. The code samples on page 3 clearly suggest that VB.NET insulates the developer from such pitfalls.\n\n* \"You can write code to respond to Application and Session events in the Global.asax file.\"\n\nThe following summarizes application-scope event handlers:\n\n    Application_Start\n    Application_End\n    Application_BeginRequest\n    Application_EndRequest\n\n    Session_Start\n    Session_End\n\n* \"In Web forms, a session is a unique instance of the browser.\"\n\nThe following summarizes the page-scope event handlers firing in sequence:\n\n    Page_Init\n    Page_Load\n    Page_PreRender\n    Page_Unload\n    Page_Disposed\n\nThe following summarizes the other page-scope event handlers:\n\n    Page_Error\n    Page_AbortTransaction\n    Page_CommitTransaction\n    Page_DataBinding\n\n* \"You can couple the Page_Load event with the IsPostBack property to initialize data the first time a user visits a Web form.\"\n\nThe following summarizes the server control-scope event types:\n\n    Postback events (e.g. the Click event)\n    Cached events (e.g. the TextChanged event; see below)\n    Validation events (solely of the validation server controls)\n\nThe lesson refers to \"Cached events\" for the sake of completeness but not clarity. This term should not be confused with \"cache events\": Cache events are not really .NET Framework events but are a design pattern featuring the CacheItemRemovedCallback delegate. This is discussed in detail in Chapter 12, \"Optimizing Web Applications with Caching\" under \"Responding to Cache Events.\"\n\nCached events reveal the design goal of the ASP.NET team to try as much as possible to replicate Windows Forms eventing by \"postponing\" events on the client and processing them later on the server.",
  "Tag": "kb2076071619"
}