{
  "Document": {
    "DocumentId": 2076071631,
    "Title": "Open Source Office Applications: Flippant Remarks about AbiWord 2.014",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2005-01-12T18:03:43.7",
    "ModificationDate": "2005-01-12T18:03:43.7",
    "TemplateId": null,
    "SegmentId": 85,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "I am a Microsoft guy for historical and practical reasons---not for ideological reasons. When some Oracle guy has a smart remark, I say, Hey, smarty slacks, back in the early 1990s when I was learning SQL I could not walk into an Office Depot and pick up a $99 Oracle database (with that special, software-laundering, anti-trusting \"competitive upgrade\" price). But I could get my hands on Microsoft products and this got me hooked---the MS Borg assimilated another victim.\n\nNow that my Office Depot days are over, here comes MSDN Universal Subscriptions via my W2 labors---so now I'm on the harder stuff and from my W2 point of view, I am getting Microsoft software \"for free.\" So why would I care to write about AbiWord, this Open Source fledgling?\n\nWell, Microsoft employees can console themselves by considering my flippant remarks a minority opinion (in every sense of the term) but I don't think I am suffering from a terminal case of brown-eyed myopia when I say that MS Office is a bloated nebula of COM objects---composed of balls of strange orange gas and truly stellar objects. The gassy part of MS Office is really starting to stink when I think of my data as cross-platform XML data sets---and I am writing this sentence being fully aware of InfoPath and the XML features in Word 2003. So when I hear that AbiWord can read and write XHTML, I sit up and take notice. Unfortunately, these are the first few AbiWord bullets flying past my head:\n\n* AbiWord 2.014 provides no way to edit http: or mailto: hyperlinks that I can see, coming from a Microsoft Word perspective (which means I right-click on the hyperlink and I see a command like Edit Hyperlink). This non-feature alone drives me away from AbiWord 2.014.\n\n* The toolbars in AbiWord 2.014 are out of the early 1990s. Don't take me back.\n\n* Features that resemble replacing-text-as-we-type (Auto-Correct or Intelli-Sense) does not appear to be in AbiWord 2.014. And I say this while seeing the Insert > AutoText command in AbiWord 2.014.\n\n* The kerning and hinting information of the default font in the Windows version of AbiWord 2.014 does not appear to be recognized. Inconveniences like these may be beyond AbiSource control. I am aware of how hostile Microsoft can be to its competitors big and small.\n\n* I see nothing in AbiWord 2.014 that handles XML Schema information. I do not think that AbiWord 2.014 is designed from the ground up to be part of an XML workflow. Microsoft is trying to begin to start thinking about tinkering with XML-based products but the design goals at Microsoft are preoccupied with domination instead of integration (and of course another patch Tuesday is coming up).\n\nThe main point of this rant is that I am completely unaware of a tool that is as convenient as a Word processor but it also is a built for rich data interchange. With MS InfoPath the price of entry is having a definite schema in mind. With MS Word 2003 you don't need to have a definite schema to get started (you can add that later), but the formatting of your document effectively---by default---belongs to Microsoft. Out of the box, Microsoft Word 2003 will allow you to interchange your raw text data with a custom schema but it will not let you interchange your formatting information with a custom schema---and I say this with the letters WORDML dancing in my head. I suppose you can \"schema-tize\" your formatting but the temptation to write your own code is not far away (and I am well beyond tempted). This limitation is unacceptable and as long as Microsoft pays little or no attention to this \"minority problem\" I will keep my brown eyes on tools like AbiWord.",
  "Tag": "kb2076071631"
}