{
  "Document": {
    "DocumentId": 2076071620,
    "Title": "MCAD/MCSD Notes: Chapter 2, Lesson 3; Where Does Processing Occur?",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2004-12-21T23:12:45.903",
    "ModificationDate": "2004-12-21T23:12:45.903",
    "TemplateId": null,
    "SegmentId": 83,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "Lesson 3: Where Does Processing Occur?\n\nThe purpose of this lesson is to examine IIS, its definition of a Web application, to define the \"application domain\" and to distinguish IIS 6.0. This lesson ends with configuring Session duration.\n\n* \"IIS defines a Web application as any file that is executed within a set of folders on your Web site... The application boundary starts in the root application folder... The application ends at the last subordinate folder or when another root application folder is encountered.\"\n\n* \"A start page is a page designated by Visual Studio as the first page to display in  your application.\"\n\n* \"The IIS default document is the page that IIS displays...\" when the incoming request does not specify a page.\n\n* \"...IIS specifies these default document file names: Default.htm, Default.asp, Index.htm, and Iisstart.asp.\"\n\n* \"When IIS receives a request for a resource within a Web application, IIS uses aspnet_isapi.dll to call the ASP.NET worker process (aspnet_wp.exe).\"\n\nThe worker process then loads the compiled assembly into a process space called \"the application domain,\" which maintains process isolation for each Web application. (This is not the case for DLLHost.exe of ASP). IIS 6.0 uses w3wp.exe instead of aspnet_wp.exe. The process instances created by w3wp.exe can exist within multiple application pools.\n\nThe lesson then goes on to describe the importance of Session states. The second reason, \"They determine when the application ends...,\" sounds strange to me. My first thought is, Ok does that mean that session-less web applications never end?\n\nThe <sessionState> element, its timeout attribute, is used to determine when the Web application ends.\n",
  "Tag": "kb2076071620"
}