{
  "Document": {
    "DocumentId": 2076072231,
    "Title": "Windows Server 2008 R2: “Using Remote Desktop”",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2009-08-28T23:22:15",
    "ModificationDate": "2009-08-28T23:22:15",
    "TemplateId": null,
    "SegmentId": 79,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "To allow remote connections for administrative purposes only, you do not have to install the RD Session Host role service. Instead, you enable Remote Desktop on the computer that you want to remotely administer.\n\nRemote Desktop supports only two concurrent remote connections to the computer. You do not need Remote Desktop Services client access licenses (RDS CALs) for these connections.\n\nYou can use the following procedure to enable Remote Desktop on a Windows Server 2008 R2 computer.\n\nMembership in the local Administrators group, or equivalent, on the computer that you plan to configure, is the minimum required to complete this procedure.\nTo enable Remote Desktop\n\n   1. Start the System tool. To start the System tool, click Start, click Run, type control system and then click OK.\n\n   2. Under Tasks, click Remote settings.\n\n   3. In the System Properties dialog box, on the Remote tab, click either of the following, depending on your environment:\n\n          * Allow connections from computers running any version of Remote Desktop (less secure)\n\n          * Allow connections only from computers running Remote Desktop with Network Level Authentication (more secure)\n\n      For more information about the two options, click the Help me choose link on the Remote tab.\n\n   4. Click Select Users to add the users and groups that need to connect to the computer by using Remote Desktop. The users and groups that you add are added to the Remote Desktop Users group.\n\n      Members of the local Administrators group can connect even if they are not listed.\n\n[http://technet.microsoft.com/en-us/library/cc742816.aspx]",
  "Tag": "kb2076072231"
}