{
  "Document": {
    "DocumentId": 2076071992,
    "Title": "The Three Original Liberal Arts; the Trivium; the Quadrivium",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2008-08-22T14:52:49",
    "ModificationDate": "2008-08-22T14:52:49",
    "TemplateId": null,
    "SegmentId": 86,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "“In medieval universities, the trivium comprised the three subjects taught first: grammar, logic [dialectic], and rhetoric. The word is a Latin term meaning “the three ways” or “the three roads” forming the foundation of a medieval liberal arts education. This study was preparatory for the quadrivium.”\n\n“Logic is concerned with the thing as-it-is-known,\nGrammar is concerned with the thing-as-it-is-symbolized, and\nRhetoric is concerned with the thing-as-it-is-communicated.”\n\n[http://en.wikipedia.org/wiki/Trivium_(education)]\n\n“Rhetoric is the art of speaking or writing effectively: as the study of principles and rules of composition formulated by critics of ancient times, and the study of writing or speaking as a means of communication or persuasion. In Greece, rhetoric originated in a school of pre-Socratic philosophers known as Sophists c.600 BC. It was later taught, in the Roman Empire, and during the Middle Ages, as one of the three original liberal arts or trivium (along with logic and grammar).”\n\n[http://en.wikipedia.org/wiki/Rhetoric]\n\n“The quadrivium comprised the four subjects, or arts, taught in medieval universities after the trivium. The word is Latin, meaning \"the four ways\" or \"the four roads\": the completion of the liberal arts. It was developed by Martianus Capella. The quadrivium consisted of arithmetic, geometry, music, and astronomy. These followed the preparatory work of the trivium made up of grammar, logic (or dialectic, as it was called at the times), and rhetoric. In turn, the quadrivium was considered preparatory work for the serious study of philosophy and theology.”\n\n“Arithmetic is the Discrete At Rest\nAstronomy is the Discrete In Motion\nGeometry is the Continuous At Rest\nMusic is the Continuous In Motion”\n\n[http://en.wikipedia.org/wiki/Quadrivium]\n",
  "Tag": "kb2076071992"
}