{
  "Document": {
    "DocumentId": 2076071688,
    "Title": "MCAD/MCSD Notes: Chapter 7, Lesson 2; Using Unmanaged Code",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2005-06-29T17:20:27.117",
    "ModificationDate": "2005-06-29T17:20:27.117",
    "TemplateId": null,
    "SegmentId": 83,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "Lesson 2: Using Unmanaged Code\n\nThe purpose of this lesson is to highlight the backwards-compatibility features of the .NET Framework, it's ability to create static entry points into Win32 COM interfaces. This lesson is quite forthcoming about the limitations of these features.\n\n* \"The process of executing native code from within a .NET assembly is called platform invoke, or pinvoke for short.\"\n\nThe \"native code\" is usually in the form of a COM DLL (of \"DLL Hell\" infamy). These are called by declaring the System.Runtime.InteropServices.DllImportAttribute as in the lesson's code sample:\n\n    [DllImport(\"KERNEL32.DLL\", ...)]...\n\nWhen \"invoking\" the Win32 platform, data is exchanged between the .NET Framework and the Win32 API in the form of passing parameters and reading results. This data exchange is often in the form of custom types defined by data structures.\n\n* \"Structures in .NET are defined in much the same way that they are for the Win32 API. By default, .NET structures are arranged sequentially in memory in the order in which they are defined... You can also explicitly define how structures are ordered in memory using the StructLayout attribute.\"\n\nThis is the System.Runtime.InteropServices.StructLayoutAttribute with the form:\n\n    [StructLayout(LayoutKind.Sequential)]...\n\nThis lesson may suggest that the reason why struct (in C#) and Structure (in VB.NET) exist in .NET languages is to facilitate structured data exchange between the .NET Framework and the Win32 API. It definitely suggests in the code samples that Class definitions (with all public fields) can also be used instead of struct types.\n\n* \"Declaring a layout is required when you're passing objects to unmanaged code, because objects might be moved around in memory after they are created.\"\n\nDiscovering exactly what data needs to be structured and passed into the Win32 API is no trivial task. For more information, please see:\n\n    \"Marshaling Data with Platform Invoke\"\n    http://msdn.microsoft.com/library/en-us/cpguide/\n        html/cpconmarshalingdatawithplatforminvoke.asp\n\n    \"P/Invoke (Platform Invoke) links and resources\"\n    http://dotnetjunkies.com/WebLog/imranko/archive/2004/10/24/29558.aspx\n\n    \"Platform Invoke Cheat Sheet\"\n    http://www.gotdotnet.com/team/clr/bcl/TechArticles/\n       TechArticles/PInvokeHelp/FAQ.aspx\n\n* \"Unmanaged procedures typically return a value that indicates whether an exception occurred... Nonzero return values usually indicate success, and a zero return value indicates that an exception occurred.\"\n\nThe lesson's code sample used to illustrate the use of Marshal.GetLastWin32Error() does not recognize the existence of the System.ComponentModel.Win32Exception type. With this recognition the code can refactored as:\n\n    // MoveTo returns False if there is an error.\n    Win32Exception ex = new Win32Exception(Marshal.GetLastWin32Error());\n    string msg = ex.Message;\n\ninstead of this:\n\n    // MoveTo returns False if there is an error.\n    string msg ;\n    // Set a message depending on error code returned.\n    switch (Marshal.GetLastWin32Error())\n    {\n        case 2:\n            msg = \"File not found.\";\n            break;\n        case 3:\n            msg = \"Path not found.\";\n            break;\n        case 5:\n            msg = \"Access denied.\";\n            break;\n        case 15:\n            msg = \"Drive not found.\";\n            break;\n        default:\n            msg = \"Unlisted error.\";\n            break;\n    }\n\n\n* \"Limitations of Unmanaged Code... Although native code can perform some operations more quickly than equivalent code managed by the CLR, these benefits might be offset by the time it takes to marshal the data to pass between the unmanaged procedure and the .NET assembly.\"\n\nThis performance limitation seems to be most surprising limitation of p-invoke. The others, \"type safety,\" \"versioning\" and \"code security\" are to be expected.",
  "Tag": "kb2076071688"
}