{
  "Document": {
    "DocumentId": 2076072017,
    "Title": "Gerald Horne, Race War!; Chapter 9: Race at War; On the Segregation of U.S. Blacks from those of the Empire; pp. 238–239",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2008-08-28T21:39:07",
    "ModificationDate": "2008-08-28T21:39:07",
    "TemplateId": null,
    "SegmentId": 86,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "London seemed to feel that U.S. blacks stirred up anti-racist sentiments among blacks from the Empire, and therefore should be kept separate. This was not a new thought. As early as 1920 a “confidential” missive from colonial offices from the African nation that was to become Malawi reported that “two American Negroes…came” there. One of them, a preacher, had married the niece of the notorious John Chilembwe, whose uprising shook the foundations of the Empire in Africa. His familial connection to an “American Negro” was considered duly important.\n\nThe exigencies of war had heightened apprehensions about the strategically placed U.S. minority. In a “most secret” communication in the fall of 1943, an official granted that “in an ideal world we should certainly wish to avoid having British African personnel serving alongside American coloured troops.” Why? Because “if British African troop were to placed in the position of receiving direct orders from American white personnel, there would be unending trouble.” Parenthetically, the British authorities noted that the “main points of difference” between African and African American troops were the latter’s “higher standards of education,” the presence of “Negro officers,” and “American political ideals.” The Empire was also concerned that blacks from the United States might impart seditious notions to their African brethren. All this made the United States—a headquarters of white supremacy—more appealing to many Africans and Asians, thus contributing to its growing ability to challenge the United Kingdom, not least within the Empire itself.\n\nLondon was very worried about the deployment of U.S. Negro troops in British colonies in West Africa, where their presence was thought to be disruptive. London firmly “recommended to Washington that no coloured troops” be sent to “the Gambia” or “Freetown,” Sierra Leone. Such an idea, it said,“clearly contains the seeds of trouble.” The proposal was “strongly objected to by the American commander in Accra, as by [London] and local governments.” Soothingly—and evasively—the “War Department” in Washington in words deemed “most secret” assured London that “there is no intention of using United States coloured troops in West Africa.” It did not say how this decision would affect the worldwide deployment of troops in a global struggle for survival against wily and well-armed foes.\n",
  "Tag": "kb2076072017"
}