{
  "Document": {
    "DocumentId": 2076071767,
    "Title": "Ubuntu Linux Network Connectivity",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2007-10-11T15:42:31",
    "ModificationDate": "2007-10-11T15:42:31",
    "TemplateId": null,
    "SegmentId": 73,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "Ubuntu, by default, is configured for DHCP. You can verify this by examining some configuration files related to networking:\n\n    less /etc/dhcp3/dhclient.conf\n    less /etc/network/interfaces\n\nIn the default interfaces file, edit the last lines thusly:\n\n    # The primary network interface\n    auto eth0\n    iface eth0 inet dhcp\n\nwhere auto eth0 is the recommended change. Refresh the DHCP relationship by running\n\n    sudo ifdown eth0; sudo ifup eth0\n\nIn the Microsoft Windows world, this is equivalent to ipconfig /release; ipconfig /renew.\n\nEnsure that your machine can resolve IP addresses into DNS names by editing /etc/resolv.conf and making 'nameserver' entries.\n\nWhat also may be handy is to restart the network:\n\n    /etc/init.d/networking restart\n\nA step-by-step Ubuntu server set up is at howtoforge.com, \"ISP Server Setup—Ubuntu 5.10 'Breezy Badger'\" here:\n\n    http://www.howtoforge.com/perfect_setup_ubuntu_5.10\n\nYou can display the IP address of the server by tacking on ifconfig in /etc/rc.local. This is useful for us unfortunates who cannot obtain a static IP address and we cannot use port forwarding.\n\nAnother DHCP issue is that, by default, /etc/dhcp3/dhclient.conf requests a list of DNS servers (see the request line in dhclient.conf). This will automatically overwrite /etc/resolv.conf. You can specify a list of domain name servers by adding/uncommenting the prepend line in dhclient.conf:\n\n    prepend domain-name servers 127.0.0.1,127.0.0.2;\n\nwhere the IP addresses of the domain name servers are separated by commas. Please compare editing resolv.conf manually to \"refreshing\" DHCP with ifdown eth0; ifup eth0.\n\nOne possible solution to the problem related to the error message “No such device” (most likely on eth0), is to comment out the MAC address definition in /etc/iftab.\n",
  "Tag": "kb2076071767"
}