{
  "Document": {
    "DocumentId": 2076072134,
    "Title": "Cheikh Anta Diop, African Origin of Civilization; Chapter VII: Arguments for a Negro Origin; The Egyptian Respect for Nubia; p. 150",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2009-06-19T12:29:03",
    "ModificationDate": "2009-06-19T12:29:03",
    "TemplateId": null,
    "SegmentId": 86,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "Diodorus of Sicily reports that each year the statue of Amon, King of Thebes, was transported in the direction of Nubia for several days and then brought back as if to indicate that the god was returning from Nubia. Diordorus also claims that Egyptian civilization came from Nubia, the center of which was Meroë. In fact, by following the data  provided by Diordorus and Herodotus on the site of that Sudanese capital, Cailliaud (circa 1820) discovered the ruins of Meroë: 80 pyramids, several temples consecrated to Amon, Ra, and so on. In addition, quoting Egyptian priests, Herodotus stated that of the 300 Egyptian Pharaohs, from Menes to the Seventeenth Dynasty, 18 rather than merely the three who correspond to the Ethiopian “dynasty” were of Sudanese origin.\n\nEgyptians themselves—who should surely be better qualified than anyone to speak of their origin—recognize without ambiguity that their ancestors came from Nubia and the heart of Africa. The land of Amam, or land of the ancestors (_man_=ancestor in Wolof), the whole territory of Kush south of Egypt, was called land of the gods by the Egyptians. Other facts, such as the tornadoes and torrential rains mentioned on the pyramid of Unas, make one think of the tropics, i.e., the heart of Africa as Amélineau observes. …\n\nSignificantly, excavations in the area of ancient Ethiopia reveal documents worthy of the name only in Nubia proper, not in modern Ethiopia. In reality, it is in Nubia that we find pyramids similar to those in Egypt, underground temples, and Meroitic writing, not yet deciphered, but closely related to Egyptian writing. Strangely enough, though this point is not emphasized, Nubian writing is more evolved than Egyptian. While Egyptian writing, even in its hieratic and demotic phases, has never completely eliminated its hieroglyphic essence, Nubian writing is alphabetical.\n",
  "Tag": "kb2076072134"
}