{
  "Document": {
    "DocumentId": 895685057,
    "Title": "Book: Level 2: Programming Visual Basic 5.0; Chapter 16 Highlights (2/3): Managing Data with Data Access Objects",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "1998-10-01T13:40:23",
    "ModificationDate": "1998-10-01T13:40:23",
    "TemplateId": null,
    "SegmentId": 75,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "Using the MoveLast Method to Count Number of Rows\n\nSince the RecordCount property only returns the number of rows accessed, we need to use the MoveLast method of the Recordset object to access all of the records. By moving to the last record in the record set, RecordCount will store the number of rows in the entire record set.\n\n\nUsing MS-SQL to Count Number of Rows\n\nMoving to the last record in a recordset may take significantly longer than executing a dynamic MS-SQL query against the Database object. If this is the case, MS-SQL can be used to count the number of records. This is one form:\n\n    m_strSQL = \"SELECT Count (*) As RecCount \" _\n                        & \"FROM tblMytable\"\n    Set m_rsDAO = m_dbDAO.OpenRecordset(m_strSQL)\n\n    g_varReturn = m_rsDAO.Fields(\"RecCount\")\n\nwhere g_varReturn is a Public variant variable that will not generate a runtime error if the Fields property returns Null. In the above example, Null will never be returned but it is better to be safe than sorry!\n\n\nMore Use of MS-SQL Strings\n\nPlease see pages 16-17 to 16-19 for more ways to use MS-SQL strings.\n\n\nUsing the FindFirst and FindNext Methods to Find Data\n\nThe FindFirst and FindNext methods can be used to find all of the data in a given set of records. Below is a code fragment that finds the first order date for CustomerID =100 and then continues through the recordset until all order dates are found:\n\n    strCriteria = \"CustomerID = 100\"\n    With m_rsDAO\n        .FindFirst strCriteria\n        strList = .Fields(\"OrderDate\")\n        Do Until .NoMatch\n            strList = strList & vbNewLine & .Fields(\"OrderDate\")\n            .FindNext strCriteria\n        Loop\n    End With\n\nThe Boolean NoMatch property of the Recordset object makes up the Do...Loop condition.\n\n\nGeneral Form for Modifying Data\n\nUse the Edit and Update methods to change data in a Recordset:\n\n    With m_rsDAO\n        .Edit\n        .Fields(\"MyField\") = \"Some new string value.\"\n        .Update\n    End With\n\nNote that omitting Update and then moving off of the row will cause data to be lost.",
  "Tag": "kb895685057"
}