{
  "Document": {
    "DocumentId": 895521620,
    "Title": "Book: Level 2: Programming Visual Basic 5.0; Chapter 16 Highlights (1/3): Managing Data with Data Access Objects",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "1998-10-01T13:40:01",
    "ModificationDate": "1998-10-01T13:40:01",
    "TemplateId": null,
    "SegmentId": 75,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "DAO: Data Access Object\n\nA DAO is an automation interface for Accessing the Jet Database engine. In fact, Access is an IDE/GUI for Jet. DAO is described by a containment hierarchy beginning with the DBEngine object. The DAO object hierarchy is shown on page 16-5. To access DAO from VB, its object library must be loaded in via the Project References dialog. Currently the Microsoft DAO 3.5 Object Library is used.\n\n\nThe Recordset Object\n\nVB interacts with DAO data sets via the Recordset object. This object can be instanced using the TableDef object, the QueryDef object or a SQL string against a valid Database object. There are three types of record sets: table-, snapshot-, and dynaset-type record sets. The most commonly used record set is the dynaset type.\n\n\nThe OpenDatabase Method\n\nUse the OpenDatabase method to open a Jet .MDB or compatible Indexed Sequential Access Method (ISAM) file. The opening (and closing) has the general form:\n\n    Set g_dbDAO = DBEngine.Workspaces(0).OpenDatabase(\"C:\\MyData.MDB\")\n    'Use database object.\n    Set g_dbDAO = Nothing\n\nwhere MyData.MDB is opened against the default DAO Workspace object. An alternative way to close the database object is to use the Close method. This has the form:\n\n    g_dbDAO.Close\n\nThis method is \"better\" if the programmer wishes to recognize the specific qualities of the object instead of handling the object variable itself.\n\n\nThe RecordCount Property of the Recordset Object\n\nThe RecordCount property does not return the number of rows in the record set. It only provides the current number of rows accessed. However, it can always be used to determine if a given record set contains any rows at all. This is very useful  because any operations on zero-row record sets will generate runtime errors.\n\nThis is one form of checking for zero-row record sets:\n\n    Set g_rsDAO = g_dbDAO.OpenRecordset(\"qselZeroRows\", dbOpenDynaset)\n\n    With g_rsDAO\n        If .Recordcount Then\n            'Operate on record set.\n        Else\n            'Do not operate on record set.\n        End If\n    End With\n\n    Set g_rsDAO = Nothing\n    Set g_dbDAO = Nothing\n\nAnother form implicitly checks for zero-row record sets. This code fragment uses the MoveNext method of the Reocrdset object to move through all of the rows of the record set. The Boolean EOF property of the Recordset object is used to stop this loop:\n\n    With m_rsDAO\n        Do Until .EOF\n           'Operate on record set.\n            .MoveNext\n        Loop\n    End With\n\nIf a design calls for the MovePrevious method, the BOF property of the Recordset object should be used as well.",
  "Tag": "kb895521620"
}