{
  "Document": {
    "DocumentId": 896218239,
    "Title": "Book: Level 2: Programming Visual Basic 5.0; Chapter 16 Highlights (3/3): Managing Data with Data Access Objects",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "1998-10-01T13:40:39",
    "ModificationDate": "1998-10-01T13:40:39",
    "TemplateId": null,
    "SegmentId": 75,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "General Form for Deleting Data\n\nThis With and Do...Loop structure can be used to scan a recordset and delete records using the Delete method:\n\n    With rsDAO\n        .FindFirst strCriteria\n        Do Until .NoMatch\n            .Delete\n            .FindNext strCriteria\n        Loop\n    End With\n\nwhere strCriteria is a string containing the specified deletion criteria.\n\n\nGeneral Form for Inserting Rows\n\nUse the AddNew method to insert a new row:\n\n    With m_rsDAO\n        .AddNew\n        .Fields(\"MyField\") = \"Some new string value.\"\n        'More fields can be specified. Nulls will be inserted\n        'in unspecified fields or an error will be generated\n        'if the Required property is set to True for any field\n        'not assigned a value here.\n        .Update\n    End With\n\nNote that omitting Update and then moving off of the row will cause data to be lost.\n\n\nCreating Query Definitions\n\nAppending a compiled query to the QueryDefs collection should be done when the query (even is if is a parameter query) needs to be built on the fly and run several times. This will increase application performance. For more information see the CreateQueryDef method in Microsoft's DAO reference.\n\n\nReferencing Stored Queries\n\nIf the query does not need to be built on the fly then use the QDE grid in Access 97 to design and store the query. Now the general form for referencing and opening a stored SELECT query without parameters is:\n\n    'Set the module-level QueryDef type variable m_qdDAO.\n    Set m_qdDAO = m_dbDAO.QueryDefs(\"MyStoredQry\")\n\n    'Now open a recordset based on the query.\n    Set m_rsDAO = m_qdDAO.OpenRecordset()\n\nThe general form for referring to and running a stored action query is:\n\n    Set m_qdDAO = m_dbDAO.QueryDefs(\"MyStoredQry\")\n    m_qdDAO.Execute\n\nRecall that the style here is to use module-level variables and share them among the procedures in the module where logically possible. This requires that these variables be set to nothing after the procedure runs where logically possible.",
  "Tag": "kb896218239"
}