{
  "Document": {
    "DocumentId": 916272579,
    "Title": "Netscape Enterprise Server 3.5.1 Administration: Setting Up Restricted Access",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "1999-01-13T16:40:20",
    "ModificationDate": "1999-01-13T16:40:20",
    "TemplateId": null,
    "SegmentId": 68,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "To set up Restricted Access we need to create the user(s) and groups (if applicable), specify a restricted path and set permissions for the path.\n\nCreating user(s) and groups: Choose General Administration > Users and Groups > New User. Under New User, you are required to specify Surname, Full Name and User ID. Entering a password is highly recommended. When this form is filled press the \"Create User\" button.\n\nSpecify a restricted path: Choose Servers Supporting General Administration > (your server name) > Server Preferences > Restrict Access.\n\nUnder Access Control List Management, click \"Browse…\" under heading \"A. Pick a resource.\" Select the directory in your web you want to restrict access to from the next display (\"Choose a Part of Your Server\").\n\nUnder Access Control List Management, click the \"Edit Access Control\" button under heading \"A. Pick a resource.\" When this Java applet starts, check the \"Access control is on\" box. This applet is a table with columns Action, Users/Groups, From Host, Rights, Extra…, Continue. For now, we can only be concerned with the first two columns.\n\nIn these two columns we first want to \"deny\" access to \"anyone\" ---this means the Action column is set to \"Deny\" and the Users/Groups is left as \"anyone.\" Please see your online help for more details. Press the \"New Line\" button. This will make a second row in this table. For the second row, we want to \"allow\" access to the user created earlier.\n\nWhen this is completed, press the \"Submit\" button. This will bring up the Save and Apply Changes display. Press the \"Save and Apply\" button to save these changes.",
  "Tag": "kb916272579"
}