{
  "Document": {
    "DocumentId": 927051050,
    "Title": "VBScript and ASP PROBLEM: Dates with the Form mm/dd/yyyy Cannot Be Passed in Query String",
    "DocumentShortName": null,
    "FileName": null,
    "Path": null,
    "CreateDate": "2002-01-07T18:20:39.553",
    "ModificationDate": "2002-01-07T18:20:39.553",
    "TemplateId": null,
    "SegmentId": 67,
    "IsRoot": false,
    "IsActive": true,
    "SortOrdinal": null,
    "ClientId": null,
    "Tag": null
  },
  "Content": "If your design demands passing dates in an HTTP Query String, you will quickly find that this is a badly formed URI:\n\n    http://localhost/MyPage.html?vDate=#01/02/1999#\n\nwhere the \"#\" characters imply that this is a date to be submitted to an .MDB file. You might be able to get by with this:\n\n    http://localhost/MyPage.html?vDate=X01-02-1999X\n\nwhere \"X\" is some dummy replacement character. But I find this unattractive. Instead of coming up with my own unattractive replacement characters, the ASP Server object has its URLEncode method, where:\n\n    \"http://localhost/MyPage.html?\" _\n        & \"vDate=\" & Server.URLEncode(\"#01/02/1999#\")\n\nyields\n\n    http://localhost/MyPage.html?vDate=%2301%2F02%2F1999%23\n\nStrangely, I would rather convert the date to its underlying numerical format. The following returns the number 36162:\n\n    CDbl(DateSerial(1999,01,02))\n\nwhich may lead to the question, How can I easily parse the year, month and day out of a \"date string\"? The answer is to use the Year, Month and Day functions respectively:\n\n    CDbl(DateSerial(Year(\"01/02/1999\"), _\n        Month(\"01/02/1999\"), _\n        Day(\"01/02/1999\")))\n\nAfter conversion, the URI now looks like the following:\n\n    http://localhost/MyPage.html?vDate=36162\n\nOf course, to convert a serial date double back to its locale value requires the CDate() function:\n\n    CDate(36162) = 01/02/1999\n\nAdditionally, we should recall the TimeSerial() function and CDate(), its use on TimeSerial() values as well. For more information, as of this writing, Microsoft's KB has the article \"HOWTO: Get Date or Serial Result from DateSerial or DateValue\" (Q95510) at:\n\n    http://support.microsoft.com/support\n        /kb/articles/Q95/5/10.ASP\n",
  "Tag": "kb927051050"
}